{"label":0,"text":"The echo works fine but then you get indundated with &#34;Things to try&#34;. I am not a 10 year old that needs stimulus to tell me to do things. I found there is no way to turn this off except for .... turning off the screen. If I cannot find a suitable fix for this it goes back."}
{"label":0,"text":"I wanted to use this as a bedside clock with the ability to play music and podcasts. Sadly, it continuously scrolls the &#34;Things to try&#34; and won't stay on the clock face. Amazon is about to get this one back."}
{"label":1,"text":"Bedroom clock , ask questions,  weather reportsAlarm clock ⏰. Music 🎶 download music"}
{"label":0,"text":"Bought 2 and both quit connecting to wifi and responding to voice within 9 months. Hard and soft reset will not fix the problem."}
{"label":1,"text":"Works perfectly, Alexa turns on and off my lights, my tv, roomba!"}
{"label":1,"text":"Still needs some work on commands. Sound is equal in the regular echo so if you don't need a smart hub get a regular echo. The sound is ok with it had as much bass as my old soundlink but I mean hey gets loud on the treble and sounds clear."}
{"label":0,"text":"The sound on these is terrible. It’s like a tin can. I love my echo but this item is awful."}
{"label":1,"text":"Plug n Play set up is simple. Added battery base to make it portable. Looking forward to using the hub."}
{"label":0,"text":"It's not as good as Siri, BUT it still has some positives, it's great at playing music, and setting alarms. I personally felt that I paid too much for this product, as it was nearly half off on prime day (literally the day after I purchased it). So I'm pretty disappointed. I might still return it and get my money back. ."}
{"label":1,"text":"I love my new echo.  It gives me hours of music and help with other things.It was difficult for me to set it up,  I had to have help from a Tekkie"}
{"label":1,"text":"I sure love Alexa!  LOL!  Thank you!  Great price and product!"}
{"label":0,"text":"Get rid of the &#34;Thongs To Try&#34; screen!!!!!!!!!! Numb nuts!!!!!"}
{"label":1,"text":"Love it love it love it"}
{"label":1,"text":"Works much easier than our 3 year old one. Better internet resemption"}
{"label":1,"text":"Kids love it! I love it!"}
{"label":1,"text":"Bluetooth sound is great. Videos are crazy. It’s an amazing device."}
{"label":0,"text":"Very bad this device, I don’t know if it’s because is refurbished or what but it activated by itself , nobody is talking and he just activated and start talking. When you talk you have to yell super lauded"}
{"label":0,"text":"Eh. It’s works on and off. Half the time it does not respond when you say wake up name. Other then that works fine"}
{"label":0,"text":"This thing woke me up in the middle of the night saying “ready for setup”. It was already setup. Should be a simple thing to check  time before asking. Wife not happy..."}
{"label":0,"text":"I would not recommend this to anyone. It won't load netflix or if it does on rare occasion it won't run the program all the way thru. It tells you the we are unable to process this title at this time. Try again later.  It is not the Netflix site cause I can stream it just fine on my computer.  Its the Firestick. very disappointing."}
{"label":1,"text":"I am pleasantly surprised at the accuracy of Alexa. The unit is very responsive and can easily respond even with TV or music playing.I did pair two smart  bulbs and they go on, off and dim with ease using voice or app. Fidelity is very good for the size.My only regret is that I would have liked a silver model or a fabric cover but that is an unimportant issue."}
{"label":1,"text":"Being able to use it with my Alexa Echo was great!"}
{"label":0,"text":"The product sounded the same as the emoji speaker from five below my sister has ... and even that one has Bluetooth and doesn’t need to be plugged in. The only good thing about this is that you can speak to it."}
{"label":0,"text":"It's ok. The speaker is pretty terrible. Google home is a better product."}
{"label":1,"text":"Bought the 2nd firestick for bedroom. Easily installed and set up. Works great"}
{"label":0,"text":"It was harder to setup then I thought it should be, for some reason I had to default  it twice. Had to go thru too many steps to setup and find my devices. Would be nice if it could interact with my Xfinity cable tv cable box and it also does not work with my Xfinity alarm for my house or my cameras, be nice set and disarm the alarm with Alexa. Had to install a skill app to setup bulb ??? whats that about, you ship it with your product ??? should have said (Alexa setup bulb) or (Alexa find new bulb) ??? and (Alexa setup Nest)??? it's fine that you use third party apps but Alexa should do the work for you."}
{"label":1,"text":"Love that I have command access to news such as Bloomberg TV, NPR, etc.Highly recommend that you gain access to Alexa app before setting up Device and get familiar with key features\/services...such as setting up your daily commute.If family and friends have Spot...then it’s a great substitute for Skype and Face Time...you can always “drop in” when missing loved ones or just to catch up."}
{"label":0,"text":"It is very slow compared to the echo"}
{"label":0,"text":"This product is a complete waste of money. When you ask Alexa a question \"she\" either doesn't know the answer, gives you the wrong answer or finds information off of Wikipedia!"}
{"label":1,"text":"Love it... can't stop using it.."}
{"label":0,"text":"The Firestick we were sent doesn’t work. At all.  Voice remote won’t even turn on. We did all the troubleshooting steps. Didn’t work. Contacted Amazon. They sent us a new one - with no remote\/no way to control it! We gave up and got a Roku (which works great!)"}
{"label":1,"text":"I agree ...YouTube should be on there."}
{"label":0,"text":"Now I'm weary about these picking up conversations when you are not actively using them - heard about this happening on the news.  I have 3-4, so this is very concerning.  I wish Amazon would release something widespread  or push some firmware to prevent this.  If they have, I have not heard about it yet."}
{"label":1,"text":"Still learning it. We have just started integrating the smart devices in our home with the Echo product line. We now have the Show, the Spot, two Dots and a kids Dot. Having trouble getting them to call each other but still working on it."}
{"label":0,"text":"Don't waste your money.  I own an echo gen 1, and echo gen 2 and a dot. They all do a far better job of voice recognition that the Echo Show.  In fact, it is so bad that it is virtually useless.  Also, the speaker is incredibly bass heavy....so much so that it is hard to understand voices.  I've worked to adjust the bass and punch the mids and treble, but it still sounds awful.  Finally, the screen just doesn't add much.  I can't see if from across the room, it rarely activates in any meaningful way, and when it doesn't, it is more of a distraction than a help.(Using FaceTime is so much more practicalthan using the Show.) I'm surprised Amazon didn't make this a little more useful than it is.  Perhaps in the future, but for now, it is a waste of time and money."}
{"label":1,"text":"I’ve been waiting for Prime Day to purchase an Echo Plus and now, I’m enjoying learning what Alexa can do. With a new Sonos One and an Echo Dot, I have the makings of a really nice and well-integrated smart home. Love it!"}
{"label":1,"text":"I am extremely impressed with this item. Bought it from the &#34;warehouse&#34; or &#34;outlet&#34; with a &#34;minor imperfection. Can't tell it even has one. works great. Didn't come in packaging, but it was sealed up and had no damage and wasn't missing anything. I like the sound quality, I see some knock it. It's not a BOSE but it's more than great for our family. Easy to use, minor learning curve as it learns your voice. It integrates seamlessly with my other amazon services.Can't wait to get for my classroom too! It's a lot of fun even just as a speaker, let alone what I plan to do with it."}
{"label":0,"text":"All the new Amazon products I have are great everything I bought refurbished is complete garbage. I will never purchase Amazon refurbished again total dissatisfaction"}
{"label":1,"text":"I love it. It plays my sleep sounds immediately when I ask"}
{"label":1,"text":"Didnt think id get an Alexa device, but this is perfect for my home office.  the screen adds just that little piece that makes it worth the extra cost of the other Alexa devices.  It can show lyrics of songs, play my xm radio, can show videos of movie trailers and news.  Its great!"}
{"label":0,"text":"Stopped working after 7 months. The warranty was only good for 3 months. I would have assumed an amazon product sold on amazon would have had higher standards than guaranteeing that it would work for 3 whole months. I mean what is this product supposed to be, a piece of junk?They offered my a 15% discount if I wanted to buy another one. Why would I want to buy another one?"}
{"label":1,"text":"I bought two.  One for me and one for my daughter who lives in another state.  We love it!!"}
{"label":1,"text":"It has all I need for my life plans time date music"}
{"label":1,"text":"Never would know it was refurbished."}
{"label":1,"text":"I love this device! All the functionality of an Amazon Echo with the added benefit of a video screen. It looks great on my nightstand as a clock (lots of faces to choose from) and displays weather, reminders, etc. I think it can do video calls too but I use FaceTime for that anyway. It’s a great shape and doesn’t take up a lot of room. I’m planning to get another one for my guest room. Awesome for a great price!"}
{"label":0,"text":"Sound is terrible if u want good music too get a bose"}
{"label":1,"text":"It worked exactly as expected and the speaker has great sound. It is perfect for my classroom!"}
{"label":1,"text":"Great technology!! Can't believe the speaker volume and quality is so wonderful. Wish I had bought another one!"}
{"label":1,"text":"Kids love it! I love it!"}
{"label":1,"text":"Cool little speaker..I love her alarms and connected it to my speakers and it sounds great!!"}
{"label":1,"text":"Works great - I put this in my son's room and use the drop in option to get his attention when he is gaming or watching tv."}
{"label":0,"text":"The sound quality is not that good, especially for the price that you pay for this. I would recommend to get the Echo Dot and buy a better speaker instead. Maybe Sonos and use the Echo dot."}
{"label":0,"text":"&#34;NEVER BUY CERTIFIED AND REFURBISHED ECHO DOT &#34; I bought a &#34;Certified and Refurbished &#34; Echo Dot. This unit is very poor in receiving command and sometimes it does not even acknowledge the command. Never buy a refurbished Echo dot. The unit I received was probably never was certified and refurbished as indicated. I also bought a new ECHO dot, it works perfectly.Very disappointed !!!!"}
{"label":1,"text":"I love it, in my living room"}
{"label":0,"text":"Never could get it to work. A techie friend looked at it for me and said the adapter wasn't strong enough to power it and that it looked like it had been bought at a dollar store. So, I am going to replace the adapter and hope it works then."}
{"label":1,"text":"WooHoo! $20 on Prime Day; done!"}
{"label":0,"text":"I bought this for myself and i didn’t realize it had to be plugged in just to work. It isn’t convenient to make them always have to connect to a wall. It should’ve been more clear when i bought it."}
{"label":1,"text":"I love the way it is designed. And you have choices for the face.  I use it for my bed side.  I drop in; on my echo in another part of the house frequently without yelling."}
{"label":1,"text":"It's an echo, and it works.  For the price it's great deal. Have had no issues with it.  As with all dots, the speaker is a bit tinny, but good for a second unit, or if you are like me, you can attach it to an external speaker for more sound.Good buy"}
{"label":1,"text":"Music mainly but still checking other features"}
{"label":1,"text":"I definitely like this product.  Wanted to be able to watch Netflix on my tv!  Easy to install!"}
{"label":0,"text":"Bought this for my son and it didn’t work. He had to return it."}
{"label":0,"text":"Unit came with the wrong plug, will have to send back to Amazon."}
{"label":1,"text":"It's easy to set up and use. There are new features and skills added all the time."}
{"label":1,"text":"Plenty of options to choose from!"}
{"label":1,"text":"Just like it's big sister, the Echo, only smaller, with slightly less audio fidelity, but much lower price (on amazon prime day:-)Used in another room to add Alexa to an additional room."}
{"label":0,"text":"The echo part works fine.  The hue hub is a disaster.  It worked for a few months and then nothing.  I spent 2 hours on the phone with tech support one =y to have to send it in for repair.  I am now trying to reconnect my lights.  What a pain.  I am having to reset each light bulb.  It can take up to 5 times to get it to reset.  I have spent hours on this.  I will say customer service was friendly and tried to be helpful.  Stick with the echo and smart plugs for lamps."}
{"label":0,"text":"Need to be able to connect to more 3rd party viceo apps"}
{"label":0,"text":"Can’t be used as a baby monitor which is why I had purchased it.  I didn’t realize this until I read the reviews on the Alexa skill for syncing the Nest Cam.  Considering all of the poor reviews and the fact that it should be simple to fix, surprised Amazon hasn’t upgraded the software to allow more than 39 minutes of viewing or alerts like you get on the Nest app."}
{"label":1,"text":"Love listening to music. Still trying to learn everything it does."}
{"label":0,"text":"I would love this but there is no way to stop the screen from constantly scrolling through “things to try”. If Amazon would make this a setting I would change my review to 5 stars."}
{"label":1,"text":"Great. Definitely gets a little old after a while but for $30 I can't really regret it at all. Love having it hooked up to my speakers via bluetooth and waking up to The Smiths."}
{"label":1,"text":"So far I’m very pleased with my Echo Show.  The problem is, there’s so much it can do that I haven’t been able to explore the extent of its abilities! I got the special price as part of the Prime Day promotion...and you just can’t beat what you get for the price.  Very pleased with the sound. The video screen is sharp. Sometimes it takes a few tries to get Alexa to perform a command...but as I get to know the system better, I’m hoping that will improve.  One drawback in the music...I’ve noticed a lot of the songs from years past, are re-recordings by the original artist...but not the original recording itself.  Example: Secret Agent Man by Johnny Rivers...a “live”version is used, not the original version.  If I’m going to pay for Prime Music...I’d like to hear the original version of songs...not later recordings.  Or at least give me a choice of what I want to hear.  Otherwise, I am very pleased with my Echo Show.  So pleased in fact, that I bought a second one!"}
{"label":1,"text":"I use the product as an alarm clock. I love being able to set my schedule for the week and not worry about it. When images are shown, they are cut off. Little because its trying to fit it into a circle."}
{"label":0,"text":"For as awesome as the Echo and Echo Dots are, the Spot is a disappointment. There is very little control over what the screen shows, what the clock looks like, what order things show up in, etc. At this point if I hadn't thrown the box away immediately, I would have sent it back and just got another full size Echo."}
{"label":0,"text":"Weak sound. Compared to the Google Home Mini the sound is bad. Also you need Prime to have a small selection of music and need prime music to play everything. Also if you get two you need prime family music to play music on both. I think it's lame that you need a family plan to use multiple devices."}
{"label":0,"text":"It worked for a month or so then it stopped. I've tried everything to try and make it work but nothing is working. I want a refund"}
{"label":0,"text":"I am not super impressed with Alexa. When my Prime lapsed, she wouldn't play anything. She isn't smart enough to differentiate among spotify accounts so we can't use it for that either. She randomly speaks up when nobody is talking to her. Just today I unplugged her...not sure I'll ever use my Alexa again."}
{"label":1,"text":"Small convenient and dependable. This dot is a cutie and Alexa does the job you ask.My only issue is the fidelity which is to be expected in a such a small speaker"}
{"label":0,"text":"It was supposed to come with a free Hue lightbulb on Amazon Prime Day.  No light bulb arrived.  False advertising!"}
{"label":1,"text":"Easy to set up, can control Kasa smart plugs no problem.  Even the kids have figured stuff out that I would not have asked Alexa, like telling jokes and singing. The Alexa app controls my custom spark plug and my cloud cam."}
{"label":1,"text":"I really love the hub feature"}
{"label":0,"text":"I’m very unhappy with this Firestick, every time we change programs or channels within a program there is a very long delay. We have 2 Roku’s That work just fine and are very quick."}
{"label":0,"text":"I just think that it's to darn confusing. And there are parts that i would try and just wouldn't work. I just don't like it. Not what i thought it would be."}
{"label":0,"text":"I am so disappointed in this product.  I tried to install two different units and neither one of them were successfully completed.  Hours with Amazon technicians.. resetting each of them.  The app didn't connect the Echo Plus to the internet connection.  Tried using the application on a phone, a tablet and on a Chromebook... No luck.  There are no clean directions on the application.  Probably sending this back to Amazon..mark this as Not ready for prime time."}
{"label":1,"text":"I bought this specifically so my wife could look at our Arlo security cameras from the bedroom when I’m at work. The system worked for three days and now it just gives me a error message. Very disappointed due to the fact that they advertise that these systems work together. I gave four stars because it does everything else very well."}
{"label":0,"text":"Disappointed that this device Is not able to access youtube as of Dec 2017. I wasn’t aware of that when I purchased it. I’ve had problems with my device. The voice stops working throughout the day. I can see it trying to respond to me, because the window it opens contains the info I asked about, but it’s like the device gets stuck in the process. It stops working, and the blue bar just flashes. I keep having to unplug and restart the device. Once I do that, it starts working again. So irritating. This device could really be a great device if Google and Amazon would act like grownups..."}
{"label":0,"text":"I haven't figured out how to make or receive calls.  Device tells me I need to register and I do not know what to do."}
{"label":1,"text":"So far all.i can say is I love it"}
{"label":1,"text":"Great addition to my Alexa base. Using it in my guest bedroom for music, clock and info.Dot speaker is not as strong as the base but it's a great value"}
{"label":0,"text":"no it is broke and I can't get help fixing or replacing it"}
{"label":0,"text":"Thought it would be more powerful and have a lot more functionality. Not much better than the Echo dot. Not worth the money."}
{"label":1,"text":"Nothing to dislike I love my new toy that has made my house a smart home."}
{"label":0,"text":"I switched to google. The amazon helper is more for shopping, and google is the tasks assistant."}
{"label":1,"text":"During Prime Day this 2nd gen Echo was on sale so I couldn't resist! This was the beginning to my smart home set up and I couldn't be happier to say that Alexa has done an amazing job connecting to all of my \"smart\" devices. Thanks to her, I can control my lights, smart plugs, TV, etc. I had no trouble connecting the Echo to my WiFi and my phone. The app works perfectly fine and it let's you add skills, routines, smart devices, timers, and so much more! Sound quality is good enough for me, since I am not an audiophile. Alexa can hear my voice even when watching movies at a high volume. Design is great and modern, it will definitely add a nice touch to your home and you can change the covers if you'd like as there are more for sale. Overall, this is a great addition to my home and enables so many possibilities. If you haven't yet, be sure to add Alexa to your home!"}
{"label":0,"text":"I set up the Echo Dot and it worked for an hour and then died completely. DO NOT BUY refurbished!!!! I sent back for return the day after I received."}
{"label":0,"text":"Ordered 2 on deal day. 1 doesn’t work and 2 nd just went down after 2 days 😏"}
{"label":0,"text":"I bought an echo dot that had been refurbished but its stops whatever function its performing quite often, doesn't wake up every time, randomly turns on but does nothing. Do not buy a refurbished Echo dot."}
{"label":0,"text":"Menu doesn’t work. Says it can’t connect to amazon network"}
{"label":1,"text":"This is our 5th Amazon Echo device.  We have purchased refurbished before and been satisfied, this time is no different.  You can't tell this from brand new, and the price was $10 cheaper.  Our Echo's wake us up, keep timers, play music for us, act as encyclopedias, turn our lights on and off and so much more."}
{"label":0,"text":"All is fine with the Spot exact for one massive failing.  In order to turn off a repeating alarm in the morning you pretty much have to talk - which is not a thing you usually want to do when first woken up and your bed partner will definitely not like.  YES, you can manually swipe up on the alarm face to dismiss but i) swiping up rather than touching screen when you are half asleep is very difficult and results in setting snooze more than half the time even if you really try to swipe to dismiss and ii) if you do manage to swipe up to dismiss, then you completely delete your recurring alarm.This is especially annoying as Amazon could so easily fix this by simply making touching the screen turn off the alarm but NOT delete it or at least make it a setting to decide whether touching the screen for a recurring alarm snoozes or turns it off.  But as the clock has been out for a year now and they still haven't adding this setting, clearly not going to happen.  This may be the biggest product design screw up Amazon has ever made."}
{"label":1,"text":"Whats not to like about this speaker.  Just ask Alexa"}
{"label":1,"text":"I have been hesitant to purchase anything smart home because I am just not good with electronics.  However this surprised me how easy it is to set up and it links to the Bluetooth in my sound bar for my TV which provides extra sound for music, I can make calls and finally hear people when home. I do not have cable, only the paid apps like Netflix and Hulu so when Alexa provided me news stations, weather and other updates it was really great to hear! I have linked all of my accounts to her, she turns on my lights before I walk through the door. She purchases re-orders off of Amazon for my pets and I heard if something bad happened at your home she would place a call to 911 regardless if she was unplugged or not.  This is important as an extra layer of protection for someone living alone.  My tech savvy bf went out and bought her after a week of me having her. Must buy!!!"}
{"label":1,"text":"Works like a new one.  Can tell the difference from the new one I bough and the refurbished one."}
{"label":1,"text":"I have had no problems with my Echo Plus. Would purchase it again."}
{"label":1,"text":"Use the product for music and it’s great!"}
{"label":1,"text":"Fantastic product, I use it as a smart home hub and to play music through speakers mainly, the customizable routines are so nice and very easy to program"}
{"label":1,"text":"Great to play music throughout the house. Great and easily fits in my decor of my home"}
{"label":0,"text":"I'm sure the Echo is as cool as everyone says....but I won't get to try this one. Even though I have a Large covered porch.....the package was left on my top step on a day forecast for 100% chance of rain.....and rain it did, soaking the package. I'm not even going to open it and see how bad the damage is. This order has been cursed from the beginning. Ordered as a Birthday Gift and Delivery was not made on scheduled day. Now I get it, and its rain-soaked."}
{"label":0,"text":"At a volume setting of half or less, the speaker sounds like there is something rattling, crackling or vibrating in it.  I'd understand if the volume was set higher.  All speakers get distorted when over-driven.  But this doesn't sound like this is an over-driven case; sounds like more of a rattle\/crackle.  Possibly because the bass is too high.  Learned that there is no ability to adjust any of the sound characteristics (other than volume).  I will attempt to exchange it assuming it is just an isolated problem."}
{"label":1,"text":"Really enjoying my firestick can’t wait to get rid of  cable such a waste of money."}
{"label":0,"text":"I'm an Echo fan but this one did not work"}
{"label":0,"text":"Doesn't always respond when spoken to with promp word. I thought it would connect to my echo upstairs and use it like an intercom haven't been able to do that."}
{"label":0,"text":"Didn’t really work as smooth as they make it seem like."}
{"label":0,"text":"It's like having another kid in the house; I have to constantly repeat myself.I can tell Alexa to do something clear as day, and according to the history, she hears something comeletely different.The device is really cool, and I like the concept, which is why it gets two stars. However, it just doesn't work as intended.I find myself irritated more often than not when I use this device."}
{"label":1,"text":"Love my fire stick and remote, so easy to set up and use. Endless amounts of apps to download! Used it with my smart tv and it’s 100X better than the features smart TVs offer"}
{"label":1,"text":"Loved it till someone stoled it. Can't afford to replace it yet but I am going too."}
{"label":0,"text":"This worked well for about 6 months but then stopped connecting to the internet (wifi) and none of the trouble shooting efforts worked.  Amazon customer service couldn't help further and told me warranty was only 3 months, which was very disappointing, so they weren't willing to replace."}
{"label":0,"text":"I am not super impressed with Alexa. When my Prime lapsed, she wouldn't play anything. She isn't smart enough to differentiate among spotify accounts so we can't use it for that either. She randomly speaks up when nobody is talking to her. Just today I unplugged her...not sure I'll ever use my Alexa again."}
{"label":0,"text":"item returned for repair ,receivded item back from repair 07\/23\/18 . parts missing no power cord included.please advise"}
{"label":1,"text":"Works great, upgraded from echo dot to full size echo, couldn’t be happier!"}
{"label":1,"text":"What a great little gadget for the house. You ask and it delivers, period. Well done!"}
{"label":1,"text":"Love these.  Great in the bathroom to listen to the news during showering.  Or listen to CNN live with Serius SM."}
{"label":0,"text":"The second one which was a refurbished model did work-at least not in my home."}
{"label":1,"text":"AMAZING. It has helped me become better organized, gives me traffic updates, weather updates, and helps me maintain a good, fast morning routine."}
{"label":1,"text":"Dislike the volume. It does not sound loud enough."}
{"label":0,"text":"As an Alexa device, it works just as well as any of the other products.  Unfortunately it doesn't go up from there.  The ability to play videos is very limited.  You CAN NOT play YouTube and when you can play a video the cropping of the screen makes it look very strange. There is quite a selection of clock faces, and you can control what is displays with one glaring and VERY ANNOYING exception.  You can't turn off the &#34;Things to try&#34; screen You can turn off the screen scroll, but that defeats the purpose of having the screen.  I don't need to be reminded every 5 seconds what things I can do with Alexa.  I don't need the advertising, especially at the cost of this device.  Overall, its an expensive Alexa device with a screen that's not very useful and annoying.  I would not recommend this until the Amazon people get their act together and come up with a screen that's actually useful."}
{"label":0,"text":"I cant figure out how to use it."}
{"label":1,"text":"Small device that my kids like to ask questions. Very handy friendly interactive"}
{"label":0,"text":"I decided to buy smart door lock and decided on getting the Echo Plus to control it.  I chose a Kwikset 888 because Amazon said it was compatible and I bought 2 Dots while I was at it.  And when I posed the question, somebody in the community said it will work with Alexa.  What I didn't know was the Z-wave lock and Zigbee Alexa hub weren't compatible.  Does any body know of a lock that works seamlessly with Echo Plus?  If not, I guess my choices are: 1. Exchange the Plus for a regular Echo and buy a separate hub like Wink.  2. Return the whole Alexa system and get something else.I  don't want to just buy another hub to use along side my Echo Plus or I'll be back here asking how to integrate two hubs.The reason I kept from buying smart systems up to this point  is because I was afraid they wouldn't operate seamlessly and unfortunately I only do enough research after something doesn't work."}
{"label":0,"text":"I don’t like that it goes into sleep mode after 20-30 minutes of “inactivity”. I shouldn’t have to “wake up” the fire tv to finish watching a show."}
{"label":1,"text":"LOVE MY ECHO SHOW.  Everything about this device is wonderful"}
{"label":0,"text":"Great device, features are awesome, the interaction is fantastic. Home automation works perfect if you link up your accounts correctly. My only issue is out of (4) Echo Shows (2) of them have been sent off for repair because of the screen glitching!! These are less than 3 months old and already having issues!First repairs were sent off and they “updated the firmware” when I got the device back nothing worked, I had to update to the newest firmware for it to work again. Then (2) weeks later the glitch starts up again!I love the show but I’m getting really frustrated with the glitching."}
{"label":1,"text":"Handy if you don't expect much out of it much \"dumber\" than the assistant in my phone."}
{"label":1,"text":"works great.. nice sound and picture"}
{"label":1,"text":"It is just not as loud as I thought it was going to be."}
{"label":0,"text":"Echo Dot responds to us when we aren't even talking to it. I've unplugged it. It feels like it's &#34;spying&#34; on us."}
{"label":0,"text":"Was loving it but starting in June Hulu stopped working and crunchyroll doesn’t work either. Probably will switch to something else soon."}
{"label":0,"text":"The echo dot disconnects from the speaker about 12-20 times a day. Do not buy the refurbished product.  2 stars for effort."}
{"label":0,"text":"Alexa didn’t know answers to many questions we asked. For example we asked how many cups in a pound and she said a pound is a form of money"}
{"label":1,"text":"Super-Easy setup, only issue i find is that it occasionally loses connection with household network."}
{"label":1,"text":"The Echo Plus is great! So easy to set up and with the built in hub, it connects to other Alexa devices with a mere verbal command. I am 62 and not super techno knowledgable but this was easy for me. Have my lights integrated with Alexa and now looking at security cameras and locks. Definitely recommend the Echo Plus!"}
{"label":0,"text":"I will be returning this piece of garbage as soon as possible. With my lifetime Amazon spending approaching nearly $40,000, I’m sure I’m just a small customer to them, but I’ve rarely been so disappointed out of hundreds if not thousands of Amazon purchases.I have 8+ echos for home automation and bought this Echo Plus specifically for the built-in hub along with approximately $600+ in zigbee light switches. The voice control is subpar even when it works, and that is a rarity. Most often it does nothing. I could not be more disappointed with this product and strongly discourage you from investing in the Amazon\/Zigbee ecosystem. If you value your money, and expect a working product then you need to look elsewhere"}
{"label":1,"text":"Easy to install. Up and running in minutes."}
{"label":1,"text":"Easy to set up. Plug it in then make some selections for your preferences such as language, temp C or F etc. I am getting more familiar with it and will be adding my calendar and appointments."}
{"label":0,"text":"The Echo does not link to Direct tv even though they said it would. I have spent multiple hours on this. Made phone calls and texts. Also is missing free bulb."}
{"label":1,"text":"We are still testing this one out and so far, we like it. I was very hesitant about putting a voice activated device in our home and this would be our first. Unfortunately, it sometimes gets our WiFi light bulbs mixed up and won't turn them on but we've been able to manage and fix it. I mean, it's convenient, especially for those unable to reach to turn off lights or electronics that you could hook up to the Dot. I do like that it plays music and has reminders, alarms, etc - I'm just still getting used to the fact that The Man is always listening now."}
{"label":1,"text":"It’s smaller than the original. Looks nicer too."}
{"label":1,"text":"amazon fire stick is amazing !!!"}
{"label":0,"text":"Sound is terrible. Cannot pair with echo to play simultaneously.  Must upgrade to amazon music if you want to play more than one device at a time."}
{"label":1,"text":"Love it! It's everything I wanted and more"}
{"label":0,"text":"Waste of money over the echo generation 2.  You don’t really get anything more from a video chat on this device then you would on FaceTime or Skype and it does not cycle through your pictures when you put it on slideshow mode it sticks on the first photo and will not leave it no matter what you do I have even looked online to research articles and cannot find a solution.  I have also had problems with this device shutting down and I have not had these problems on any of the other echo devices.  Price difference is just not worth it"}
{"label":0,"text":"Terrible. Stopped working after one day."}
{"label":1,"text":"Love my two echo dots but the third one we ordered to give as a gift had a defective speaker.  The return process still isn't done and has already taken weeks."}
{"label":1,"text":"Well I’m a big fan of echoes these ones went I’m my bathrooms.  Works just great as expected 👍🏾"}
{"label":1,"text":"Easy to use easy to set up"}
{"label":1,"text":"I like being able to watch pretty much anything I want at anytime. Works great!"}
{"label":1,"text":"Upgraded from an original Echo on Prime Day and so far I love it. I'm sure I have a long way to go to maximize its utility,  but for now I owe my marked increase in lyrical knowledge to this thing. Who knew Post Malone actually used words?!"}
{"label":0,"text":"I bought this product hoping that Alexa would be pretty well developed and far enough along, therefore expecting her to be responsive. This $100 piece of crap doesnt even know how to respond to a question that amazon themselves told me to ask her. (Echo buttons manual, see Step 3.) The device has potential given it has a big screen, decent sound but for 200 bucks, I would never reccomend it. Even for the $100 I spent, I feel like I got shorted. Oh and lastly, the device is pretty useless without a prime membership. I linked my personal account to it and the thing was literally a decorated bluetooth speaker. I went on the family account (this one) and got it to work minimal. Oh, and even with our prime membership, you have to have a music pass or something that's an extra 3.99 a month, leaving this item a subscription nightmare, and a overpriced, decorated bluetooth speaker in my eyes. I would give it zero stars if I could."}
{"label":0,"text":"For the size of the screen this thing should be $25"}
{"label":0,"text":"I will never buy anything Amazon makes again!This fire stick is not even a year old and it does nothing but restart and freeze up constantly. No warranty from Amazon in this should have been my first clue that it was a horrible device. I will never buy anything built by Amazon again."}
{"label":0,"text":"I reached out to Amazon, because the device wanted to sync my phone number but it would not allow because it said my number was already in use.  Customer service couldn't help they basically told me to contact Sprint to assist.  So Echo does the bare minimum without access to my phone for set up, so its kind of pointless to have and pay for."}
{"label":0,"text":"When we first received this product, it was great.  However, about a week ago, the device served up a video advertisement around 10:30pm at night and scared myself and my family.  If you want to make sure you are protected and don't allow video directly in your home, the spot is not a device that can keep you safe."}
{"label":1,"text":"I love that I can shut the microphone off at night so my children can’t talk to it at bed time and she has an automatic sleep timer for their lullaby music. Not sure how I survived with out this for so long."}
{"label":0,"text":"Great product but returning for new Alexa Dot.  Refurbished is already giving me problems with connection."}
{"label":1,"text":"I like the looks better than the original echo.  I moved my old echo to the basement family room. Nice sound."}
{"label":0,"text":"Was excited to try this on my new Element TV.  Unfortunately even though my TV is 5 feet away from my router i get maddening disconnections and buffering.  Thought this little device was supposed to take care of that issue.  It didn’t!"}
{"label":1,"text":"Great ! It was the best decision ! Especially if you have Amazon Prime."}
{"label":1,"text":"Too soon, I'm still learning what I can do with it."}
{"label":0,"text":"I liked it until on day after a year it no longer worked, would not power up  and go past the firestick  logo on tv. Bought a second one, will not buy a third if this one doesn't last longer...."}
{"label":1,"text":"I have had for only a week, so I am still learning all that Alexa can do.  It is a learning process.  I love the music I can call up any time.  I listen to podcasts and radio stations.  I have just started keeping shopping lists and grocery lists, which I love.  I don’t have to search for paper and pencil.  Getting time and temperature are great, do not have to wait for weather reports.  The sound is good.  I am not fussy about woofers, tweeters, base , etc.  the Echo is fine for me.  This afternoon I am going to try “dropping in”.on my son when he gets home.  Going to surprise him."}
{"label":1,"text":"I like the fact that the messages are visual now as well as audible.I am puzzled because it will light up and make the &quot;notification&quot; sound but when I ask Alexa to read my notifications, she tells me that there are no new notifications.  This has happened at least once a day for over a week now."}
{"label":1,"text":"So far so good.  Not to tech savvy so, I'm still trying to figure out what I can do with it but, it was easy to set up and so far easy to use.  Lots of apps that it can use.  I will have to play with it some more but its fun to have."}
{"label":1,"text":"I've had an Alexa Dot for some time but I'm really enjoying the Alexa Show. It's great to have a visual whether it's a song or the weather. Played Jeapordy, but I'm not good at it. You do learn trivia and no one's watching! Love that recipes are visible and movies are available. Haven't had it long enough to try everything."}
{"label":1,"text":"The installation and connection to my Wi-Fi was so easy! Getting the Amazon Prime and Netflix going was a breeze. I have not used a voice remote before. That was amazing (yes, I am old school). I will be reviewing more features and options as I have time, but I am very excited to own such a product that lives up to the all the great things I have read and heard."}
{"label":0,"text":"I'll be returning it.  It's been nothing but annoying.  The hub can't be turned off if not needed and it interferes with my Hue Bridge.  I can't even install Philips lights with it unless I unplug it to do so.  There are plenty of other reviews that go in depth with the issues.  Bottom line is it sucks as a hub.  It doesn't support z-wave and zigbee (which in fairness I knew in advance), but when the one protocol it does support doesn't do many functions that a dedicated one will, what's the point?  I noticed right away that my Philips Hue Bridge supports firmware upgrades to the light bulbs themselves and this doesn't.  I found that rather interesting."}
{"label":1,"text":"bought for my wife she loves it"}
{"label":0,"text":"Item has never worked. Out of box it is broken. Spent several days trying to get it working and running same &#34;fixes&#34; from Amazon. The only thing accomplished is I will never order another refurbished device."}
{"label":1,"text":"I already bought one previously to try out and enjoyed it.  Bought these new ones during the Prime sale."}
{"label":1,"text":"So far so good.  Not to tech savvy so, I'm still trying to figure out what I can do with it but, it was easy to set up and so far easy to use.  Lots of apps that it can use.  I will have to play with it some more but its fun to have."}
{"label":1,"text":"I really like this product and the fact that I can get apps that I am unable to get on my smart tv"}
{"label":1,"text":"I like that it responds every time. It was easy to set up.  I'm still learning what I can do with it. I may like a better speaker more."}
{"label":1,"text":"I like it alot. I connected it so I can play my Pandora and I asked about the weather & time every morning. I got rid of my old fashioned digitol clock because I can have my music play Unlimited on this. I'm going to ask it about vacations and a few other things once I get more comfortable with it. Definitely worth the money."}
{"label":1,"text":"Easy setup. Was up and running in minutes. The learning feature is outstanding. Now I know why Amazon is so far ahead of the competition."}
{"label":1,"text":"We have used for last 2 weeks. We like it. My children also like it. Alexa has become part of our family."}
{"label":1,"text":"this is my 2nd echo dot and it is working just as i want it to.  i have it in the bedroom and i par it with a small blue tooth speaker.  last nite i went to sleep with sounds of a thunderstorm as provided by my echo dot.  i am planning to have the dot turn my bedroom lamps on when i receive the smart plugs that i ordered."}
{"label":0,"text":"This is the worst Amazon purchase I have made. I am big Amazon fan...love the brand...unlimited digital music...prime videos...even buy my online games, music, and movies through Amazon. This app I have tried to use it make simple purchases -- to do anything. It is useless."}
{"label":0,"text":"great product, but useless overall. Too many unnecessary features. Unless you have a smart home you don't need it"}
{"label":0,"text":"Great product and I would give 5 stars - but you can't scroll face cards without having the stupid &#34;try and ask Alexa&#34; suggestions pop up.  Yes you can have it scroll once, and just stay on the clock, but I like having other cards as well. God its the worst and SO irritating.  I got it super cheap, so i just face the screen toward the wall and treat it like a Dot instead of a Spot.  What a dumb move on Amazons​ part."}
{"label":1,"text":"My 2nd one and I use them all the time."}
{"label":1,"text":"Was surprised to learn this can be used as a Bluetooth speaker for phones and tablets... it probably lists it in the description, but I missed that part!  It not quite the surround-like quality of a Bluetooth speaker in the $100+ range, but its very good none the less.  And with even basic access to Amazon Music there is a lot to listen to.  There's a huge number of things Alexa can do, learning more every day."}
{"label":1,"text":"Love it!!! Convenient. Responsive. Learns voices within the household. Best assistant so far!"}
{"label":0,"text":"Device was not working. Followed all instructions for Alexa echo dot and it did not come on. Very upsetting."}
{"label":1,"text":"I love it! Plays great music, movies, and so much more. I does lag when u want to see your arlo security cameras thou. So far so good. Wish it had a longer cord."}
{"label":0,"text":"Very disappointed.  Alexa doesn’t hear me and doesn’t respond to my requests."}
{"label":0,"text":"Does not work all the time"}
{"label":0,"text":"cant seem to get this thing to sink with my wireless not sure If I will be returning it will try one more time."}
{"label":0,"text":"This worked well for about 6 months but then stopped connecting to the internet (wifi) and none of the trouble shooting efforts worked.  Amazon customer service couldn't help further and told me warranty was only 3 months, which was very disappointing, so they weren't willing to replace."}
{"label":0,"text":"Weak sound. Compared to the Google Home Mini the sound is bad. Also you need Prime to have a small selection of music and need prime music to play everything. Also if you get two you need prime family music to play music on both. I think it's lame that you need a family plan to use multiple devices."}
{"label":0,"text":"Really disappointed Alexa has to be plug-in to wall socket all the time.  My fault for not checking this, but made the assumption that a company has technologically advanced as Amazon would sell this product with a rechargeable battery.  If I could return it, I would as my Apple music and boom speaker give me more flexibility the Alexa."}
