{"text":"RT @TalibKweli: Do you want to hear the truth or are you only looking to hear what makes you feel all warm and fuzzy inside? I choose truth&#8230;","label":0}
{"text":"RT @rightwingertoo: Uh oh: California solar plant fries thousands of birds in mid-flight - Hot Air http:\/\/t.co\/8ZQnLR5fH5","label":0}
{"text":"What's so good about Prom? All I see is another faggot ass High School dance.","label":1}
{"text":"RT @kingdomofwench: @graceishuman I've also seen a lot of that \"We're Democrats and we're for Charlie Baker!\" ad which makes me want to scr&#8230;","label":0}
{"text":"I think dat @Miss_Facetious called me a nigger!\nWhat do move away from da dark side mean?","label":1}
{"text":"&#8220;@kitty_hello14: @Im_Yung_Jay &#127850;&#127850;&#127850;&#127850;&#127850; bitch ass nigga fuck you ! &#128079;&#128079;&#128079;&#128079;&#128079;&#128077;&#128077;&#128077;&#128077;&#128077;&#8221; &lt;= these hoes ain't got no manners #RealTalk","label":1}
{"text":"You're standing on a slippery slope where it's all too easy to... More for Libra http:\/\/t.co\/7THsA7v26i","label":0}
{"text":"RT @_ChickenGeorge: DEAD!!&#128128;&#8220;@TAkeme2CHINA: &#128553; RT @PEagles14: When ur fuckin and her pussy stank but u have really good friends........... ht&#8230;","label":1}
{"text":"Just seen a pic comparison of Lou Holtz and he grandma off Beverly hillbillies and I can't stop crying tears of unfathomable hilarity.","label":0}
{"text":"Brady heard yall say he was washed, now he washing the league on you hoe ass niggas.","label":1}
{"text":"I didn't forsake all other bitches for my wife to be getting fucked on by another nigga. and you know she married? you gotta die.","label":1}
{"text":"another long night with allergies! need better ned than zertec or however you spell it!","label":0}
{"text":"@kieffer_jason lmao why ur dad raised u to be a bitch made nigga","label":1}
{"text":"First thing I do when I hit the lotto is buying @moniqueeedavis two fat bitches and watching her eat both in one sitting","label":1}
{"text":"@THERACISTDOCTOR One less little nigger that would grow up into a big nigger.","label":1}
{"text":"RT @Slanguage: Stop flattering yourself, bitch. The only fan you have is on your ceiling.","label":1}
{"text":"@alexnolan1990 @claddos @takutaneka @regankelly91 ill give you a tip, beware of the ugly birds who hide behind massive lensed sunnies!","label":0}
{"text":"Only Blood Can Satisfy The Hungry Flames Of R&#8217;hollor, Charlie Brown","label":0}
{"text":"@ColeMcDowell2 Waco is ghetto hahaha. Wait til we go pick up nat in Austin tomorrow","label":0}
{"text":"RT @NinerFans: #Seahawks fans are scheduled to meet up at Pier 39 on SAT. @ 5PM to trash talk and heckle San Franciscans! BE PREPARED! WEAR&#8230;","label":0}
{"text":"@Ken_GTH nahh , whatever you are spook or spic, I still don't like you . Good day","label":1}
{"text":"Giving you that trailer park trash. #transformthursday #ladykimora #vegasqueens #vegasshowgirls http:\/\/t.co\/5BbMhApHrD","label":1}
{"text":"@FaZeDAVlS @SoaR_Wvyy @SoaR_Haze @FaZeOutcsT this is gobbledy gook to me because i dont have the game","label":0}
{"text":"Obama&#8217;s Newly Released Gitmo Jihadi Has Links To Terrorists In Syria http:\/\/t.co\/MywaAFD1yB #tcot #pjnet","label":0}
{"text":"Michael Sam being cut further proves that we fags don't belong in football or #NFL, it is a heterosexual sport for heterosexuals.","label":1}
{"text":"@truckpartstores Intended to get pics but didn't have time.. Must be a mud race\/event here this weekend.. Is like a redneck convoy out there","label":0}
{"text":"@kieffer_jason how would u know if I don't fuck with you? Exactly you don't wtf I got shut your retarded ass up","label":1}
{"text":"@NoMeek_JustMilz If they trash in yr 3 or 4 he'll waive it lol","label":0}
{"text":"RT @ArcticFox2016: 150 Christians MASSACRED By Jihadi Muslims While They Slept! Including Pastor, His Wife &amp; Kids http:\/\/t.co\/VnR60MjFo6","label":0}
{"text":"RT @Poochda63: I go to take the trash out and a darkskin nigga stole my damn garbage","label":1}
{"text":"RT @scottvtracy: @AbuYazidMuawiya @amustafaanbari1 Congratulations for reinforcing the stereotype for insecure, uneducated, uncivilized, ba&#8230;","label":0}
{"text":"@iowahawkblog @jjauthor to ----&gt;@DavidMasciotra get past boot camp, and go active a few years, see what we REALLY do daily you liberal pussy","label":1}
{"text":"I used to get GRs a lot, tho. maybe that's why my soles cracked so much... http:\/\/t.co\/lRCb0vabiG","label":0}
{"text":"That dumb black bitch that was getting the cards for the picture made me so fucking mad she ruined my day &#128545;&#128545;&#128074;&#128298;&#128163;","label":1}
{"text":"Big night of &#127936; #hoosiers #iubb #big10 and #pacers #nba #indiana #hoosierstate #paulgeorge #codyzeller http:\/\/t.co\/UFmje1gk","label":0}
{"text":"@Shvkxir @RickiRoma @BaeSongz @JayZOverrated Ahmed and retard mikey for special Olympic boxing","label":1}
{"text":"Look at this coon ass nigga here..... Standing on a damn toilet, looking around for his manhood...&#8230; http:\/\/t.co\/3WyPsnRLu3","label":1}
{"text":"@KellenDaniel along with the French blue and Buggs bunny VIIs, and the Oreo IVs. @LaJethroJenkins","label":0}
{"text":"@pombuenaa I'm surprised you could read it with slits for eyes","label":1}
{"text":"S\/O to my favorite nigger to work on the plantation @Pretty_WarZone just remember next time, ask for the watermelon. Dont steal it.","label":1}
{"text":"RT @BiIIMurray: My iPhone has 2 million times the storage of the 1969 Apollo 11 spacecraft computer. They went to the moon. I throw bird ...","label":0}
{"text":"@kristin12909 better nig. Lol but if anything ill flip u the 10 or something. Im tryna get some more cash","label":1}
{"text":"#faggots are MERELY a #scientific indicator that SOMETHING IS WRONG&gt; Do not celebrate as \"unique indiviuals\" for they are #cancer&gt;","label":1}
{"text":"&#8220;@My_Fish_Died: You dammn Weed potheads are annoying af on Twitter&#8221; weed and pot are the same thing faggot","label":1}
{"text":"@hunterbuch66 @kieffer_jason @sbsylvester yo fat ugly ass couldn't even pull the ugly bitch in the school","label":1}
{"text":"RT @KYHoopsBuzz: Latest DraftExpress mock draft has Randle #3, Cauley-Stein #9, Young #14, Poythress #37. Harrison twins &amp; Dakari Johnson a&#8230;","label":0}
{"text":"RT @Kriegsson: On Nigger Day we honor nigger traditions by not working.","label":1}
{"text":"RT @NoWomanIsRight: You can be a good girl all you want and those hoes still gonna get us niggas attention from time to time","label":1}
{"text":"@feverspell @NYRKelsMads I'll do it! @1dgroupiegossip In the UK, \"Fag\" means cigarette and a \"faggot\" is a bundle of sticks, you homo.","label":1}
{"text":"Just to get u mad go on your search bar on here and search up \"stupid niggers\" &amp; hop on somebodys head then mention me lol @stonethegreat23","label":1}
{"text":"@_elennamichelle nope not at all but I'm stuck in a house full of fucking niggers help me escape &#128553;","label":1}
{"text":"@JonnieSantana He's definitely trash. But if Bill Cohwer or Stanford 's head coach want the job I'd hire them. With a new gm of course","label":0}
{"text":"Whipped out some french in front of some babes at the post office. #winning","label":0}
{"text":"If a spic ever talks to a white person and the white person kills them, it's self defense.","label":1}
{"text":"\"Mine plays DMX and kirk Franklin smh @_justcallmeBRIT: Well my neighbors are ghetto . They get up at like 5am and beat their kids.\"","label":0}
{"text":"Women who are feminist are the ugly bitches who cant find a man for themselves","label":1}
{"text":"@hotzgeor Kept the border open to disease from Central America, lowest workforce part. % since Carter, yep, a real boon to NC.@ThomTillis","label":0}
{"text":"Sitting at the bar at work watching Walking Dead and all these fucking wetbacks decide to come in &amp; turn on their spic music. Jesus Christ","label":1}
{"text":"@BillionaireCrow @Neelahrelates your what's wrong with the white race you fuckin coon slaying piece of poop please die alone","label":1}
{"text":"Fredo was a bitch ass nigga. How niggas fire over 20 shots at his pops but he didn't get off 1 cuz he dropped the gun smh","label":1}
{"text":"@t5_harris Are you working on route running and catching. You'll be a good WR for Grier. Have fun with the white trash, racist UF fans. #FSU","label":1}
{"text":"Why does MSNBC have a \"news\" show that is 100% opinion &amp; right wing talking points? Joe the nation is with PBO not u teabaggers #morningjoe","label":0}
{"text":"RT @shakiraevanss: Criticize Amanda for saying the n word, sure, but don't make jokes about her sexual assault, don't be trash.","label":0}
{"text":"The rich kids of beverly hills is trash and not even entertaining trash. And why do they all look mid thirties?","label":1}
{"text":"@kcSnowWhite7 @SamSaunders42 don't forget nappy headed, butt ugly bitch, who's married to a Muslim","label":1}
{"text":"Holder&#8217;s Justice Department Isn&#8217;t Interested in the Facts in #Ferguson http:\/\/t.co\/7vH4tyPMht These race hustling bitches are DISGRACEFUL.","label":1}
{"text":"@CheckMyLingo_ @Kingpin_Terror ima get this so every time I throw trash away its where it really belongs http:\/\/t.co\/DRGBekvzun","label":0}
{"text":"@pcrossvol there's always one...they never realize they are the worst- the unsolicited unaffiliated trash talker\"","label":0}
{"text":"&#9733; BEST ASIAN MASSAGE ON THE park slope --TOP RATED SPA &#9733; 718-622-0221 - 24 http:\/\/t.co\/Br7el4ZXrw","label":0}
{"text":"I'm already tired and mr stupid af decides to show us a video on trigonometric notions so um yeah I just wanted to say you're a hoe","label":1}
{"text":"Video: Charlie Baker campaign team denies contacting Gov. Patrick for meeting http:\/\/t.co\/qHrA6OalRR","label":0}
{"text":"@BarackObama @MarchForInnov send them damn beaners back where they belong n the US aint it","label":1}
{"text":"My nig jus said ain't nuttin worse den a fat loud hoe.tru fuckin story","label":1}
{"text":"one day im like harry styles is so hot the next day is who tf is this faggot","label":1}
{"text":"@keno_ Isn't there a law that all clam chowder must be served im bread bowls? Haha","label":0}
{"text":"RT @OhWowThatsAwk: a girl tweeted \"you might be ghetto if u bring food from outside into the movies\"\n\nno u might be stupid if u pay 4.99 fo&#8230;","label":0}
{"text":"RT @thatgirlran: &#8220;If your 15\/16 ACT like your those ages not like your 20. Its not cute.&#8221; That awk moment when I thought this tweet was abo&#8230;","label":0}
{"text":"My Oriental Gallery Blog: The New Land of Free Enterprise http:\/\/t,co\/pz55t90Z","label":0}
{"text":"@karmendanielle_ u gotta slow down these coon hrs all they know is love n hip hop, lebron, &amp; fake love quotes","label":1}
{"text":"The Rick Scott\/Charlie Crist ads have been running nearly non-stop in Florida for the past week. And they are getting even worse.","label":0}
{"text":"RT @TAXSTONE: Niggaz like all them naked bitches on IG pics NIGGAZ DONT LOVE EM","label":1}
{"text":"Mcdonalds pipe self defence beating: http:\/\/t.co\/Gk5wbObJTC This is one nigger who's hand I would shake. That's how you deal with sheboons.","label":1}
{"text":"Nicholas Rushlow, wearing lucky yellow shirt, nails \"theophylline\" - \"bitter crystalline compound extracted from tea leaves\" #spellingbee","label":0}
{"text":"Charlie Rangel: Some Republicans 'Believe That Slavery Isn't Over' | Truth Revolt: http:\/\/t.co\/NpbdPk0Cqz \nBam, Race Card Vote Democrats out","label":0}
{"text":"Early morning beer as a reward for waking up and taking the trash out","label":0}
{"text":"@LokiHulibele @mediacrooks @AamAadmiParty They have mix, not all are retards. AAP is Maoists, terrorists,Congies and delusional Retards","label":1}
{"text":"RT @bigbluexpress: Cal has a day off and for giggles heads to Yankee stadium to hang with Derek Jeter. Yep coaching at UK is probably weari&#8230;","label":0}
{"text":"RT @renz360: Got receipt ink on your soles? no problem. http:\/\/t.co\/xYA7aLDUhU","label":0}
{"text":"RT @Ride907: If some little fucking faggot spits in my food I swear to god id tear your fucking arms off http:\/\/t.co\/EQociANZ77","label":1}
{"text":"RT @Buckm00se: chava needs to stay in his lane and keep sending gyro to hell you dont want it with the big boys you dirt infest ass beaner","label":1}
{"text":"@Bywatergal @Yankees @EmpireStateBldg That game winning hit in Thursday capped a great career. The guy is a 1st ballot HOF. Or else.","label":0}
{"text":"@BoneSaw00 There's a reason why the Yankees don't want Anderson any longer.","label":0}
{"text":"slow replies make me feel like a retard and I just want to put my foot through a wall... hjhdyhdhlgjdftilh","label":1}
{"text":"old fellas water froze in that funeral home. he got it unthawed and wants me to help get his pump going again, that place spooks me man..boo","label":0}
{"text":"@TreyBizzy I thought you would like him cause of the Chi but yeah he a faggot","label":1}
{"text":"@shanetallant he won't bite! We promise he's a friendly bird :)","label":0}
{"text":"Real talk not being byes or nothin! The whole NFC south glad bag trash this year none of the teams have a chance making it to the playoffs!","label":0}
{"text":"Och hoe wonderbaarlijk dat Jan het alweer met n Marokkaanse BNer aan de stok heeft. Na Fatima, Lamyea, Tofik, nu ook Abdelka te min gevonden","label":0}
{"text":"RT @UberFacts: The strings attached to boxes of animal crackers were originally put there so that the box could be hung from Christmas tree&#8230;","label":0}
{"text":"Omg!!! You won't say it to my face! Stupid ass hoes talkin shit!!! Imma whoop her ass!!! *over dramatic teenage girls*","label":1}
{"text":"A MESSAGE FOR ALL OF HUMANITY ~ Charlie Chaplin @mobengalfan @DISL_Automatic @mikehoho http:\/\/t.co\/itDIRcNt7y","label":0}
{"text":"Between this trend and the vines acting like women its like niggas couldn't wait to be faggots http:\/\/t.co\/dKVnjmCarZ","label":1}
{"text":"Roses be red\nOrchids be bigger \nDonts tell yo daddy\nYou fuckin a nigger \n#VDdie","label":1}
{"text":"This week's RFN segment is in the can. I discuss Idaho being a faggot marriage state just like Washington.","label":1}
{"text":"@AlfieHeydrich but I live in the South. Lot more here. My pop lives in Rhode Island. Hardly no niggers there.","label":1}
{"text":"my mom tried to get me to buy beaner boots bc they were on sale like I'm not in a mariachi band please stop.","label":1}
{"text":"Awk... U don't like your own nephew \/ cousins bc our race.. LMAO broke ugly bitches fuck them we don't need them","label":1}
{"text":"RT @_2kkz: This faggit bitch tried to say she hoe'd for hd bearfaced bitch yusa fag","label":1}
{"text":"Enjoy 50% off @GreenFestival #DC tickets with our code and check us out at booth #640! Vegan brownies samples &amp; more! http:\/\/t.co\/scDZnDk2Aq","label":0}
{"text":"@Lucci_Dpc What did I prove for you? That you're blissfully ignorant? Group thinker? Political chump and race traitor?","label":0}
{"text":"@white_thunduh my bitch dont want your ugly ass gtfo ol peyton manning lookin ass","label":1}
{"text":"The beautiful Fairy Pools near Glenbrittle on the Isle of Skye, Scotland http:\/\/t.co\/cyi6xSvn97","label":0}
{"text":"RT @MacMiller: @iCodyMontana @ScHoolBoyQ @xdannyxbrownx yeah they trash. Q... this man capitalized his H tho.... i'm takin all ya fans.","label":0}
{"text":"RT @Gawker: Conan O'Brien mocks the new Call of Duty game while getting killed repeatedly. http:\/\/t.co\/GfCsARhTJT","label":0}
{"text":"I def got a few shades darker cutting my mama grass. There goes my yellow frame lol","label":0}
{"text":"The chinks really hunting their food... RT @WWLTV: Dog shot with arrow in N.O. East- http:\/\/t.co\/q1KqT6STwl","label":1}
{"text":"I already know you trash if being tatted is on the list of things you want in a nigga..","label":1}
{"text":"remember when the dude who played young ned followed my youtube channel. this was when i actually used my youtube for more than favorites","label":0}
{"text":"Perhaps I'm not a \"diehard\" Yankee fan, but there's no more point in watching this debacle #Yankees #Tigers #MLB So what else is on? LOL","label":0}
{"text":"RT @Henry_3k: When I was little I remember laying horrified in bed as hand puppets held a mock trial convicting me of putting my hand up th&#8230;","label":0}
{"text":"RT @AyeeDeb: Ray J is the perfect example of what happens when you give a lame nigga some pussy.","label":1}
{"text":"Hitler didn't finish it. Can u. If a nigger ur Jew confronts u in the street what then.","label":1}
{"text":"Typically hateful, anti-Christian, mentally ill and ugly dyke trash pig couple Jennifer McCarthy and Melisa Erwin http:\/\/t.co\/tW9Nl5Hkmt","label":1}
{"text":"RT @AntiJokeJamal: If you honk your horn .4 seconds after the light turns green, I will shut off my car, lay on the hood, and feed birds fo&#8230;","label":0}
{"text":"Damn @JustDoMe_ &amp; his nigger music waking up the whole school in the morning .. &#128664;&#127926;&#128543;","label":1}
{"text":"Faux Noise pundits don't like duck molester, pro-slavery racist, #homophobic #teabagger darling Phil Robertson either http:\/\/t.co\/5gt6ZVgqXY","label":1}
{"text":"if u don't buy the box of colored goldfish you r a racist tbh","label":0}
{"text":"RT @terri_georgia: Charlie Crist Leads Rick Scott In a Florida Governor's Race Where Every Vote Will Matter http:\/\/t.co\/FWUH5pVnjk","label":0}
{"text":"I do da flow in a temple today fo nuttin. And dat Jew wit the funky hair tell me I subhuman. He tell me I ain't no mo human den a monkey","label":1}
{"text":"New test makes your poop neon colored if you have colon cancer &#8594; http:\/\/t.co\/GiGzo0ntpD","label":0}
{"text":"@NYRKelsMads \nDat damn dog eats betta den most colored folk do.","label":0}
{"text":"@SchulzGrayson @Dswizzle3 oh woulda coulda shoulda ass niggas bitch ass nigga, what u bout oh ban wagging ass nigga catch your phase","label":1}
{"text":"@JRealmo I don't think they believe in their communities ability to function w\/out whitey. They choose to be hustled by big gov't...","label":0}
{"text":"RT @Meet_Nallah: &#8220;@mckenxcassie: Some of y'all hoes so worried about y'all eyebrows y'all forgot y'all had a mustache &#128514;&#128557;&#128557;&#8221; LMAO","label":1}
{"text":"RT @Tiqqz: @ShinSnipes i woke up with a sore throat, im cold, niggers will be niggers. so terrible","label":1}
{"text":"RT @BALTsneakerShow: Water is wet. RT @202SOLE: Nike DC is trash.","label":1}
{"text":"@solopo82 y'all got the Taxis right now? And can I get the Oreo 5's right now if possible?","label":0}
{"text":"@rachel_gautreau @babyydrey hey Rachel G my name isint Kenneth ok let's just get that straight &#128070; you best be backing off before I go ghetto","label":0}
{"text":"Only in my hick town can you walk into a national sports bar and get Busch light in a can. SMH","label":0}
{"text":"Man im glad im around to see the redskins go to the playoffs considering it only happens once in a lifetime #RedskinsBlow","label":0}
{"text":"What be the peckin order?\n1 white Christian\n2 colored\n3 Porto Ricans \n4 Arab \n5 Jews \n\nI donts know. I be axin","label":1}
{"text":"Ain't shit like fucking another nigga bitch and askin her \"who pussy is this\" and she say yours lmao no bitch im stealing this pussy lol","label":1}
{"text":"Gary's girl was a tranny. RT @Em_99car: I wonder what would have become of @rickspringfield if he'd written 'Gary's Girl'.","label":0}
{"text":"RT @dxpperjay: You assholes know that referring to a girl as \"bitch\" doesn't make your dick any bigger, right?","label":1}
{"text":"If someone is part of 'James X' then he's a white trash cultist.","label":1}
{"text":"Alexa's phone gave us colors and Julia got yellow I'm dying #racistaf","label":0}
{"text":"@Anony386 @TurnToLive @Tweenki_ they are wrong you are a nigger always causung mischief among ur own people","label":1}
{"text":"5000 white men in pick up trucks screaming nigger and my coach got the nerve to get mad I missed the free throw &#128514;&#128514;&#128514;","label":1}
{"text":"Stupid white people making my posts relevant to they own life #stupid #cousintoucher #honkie #whitetrash #blonde","label":1}
{"text":"Got to 8 on flappy birds can you say happiest girl on earth","label":0}
{"text":"Scandal: A Negro Bed Wench's Fairy-tale and propaganda: http:\/\/t.co\/tp1Sa5u8uO via @YouTube: A must see for Hebrew Daughters of Zion!","label":1}
{"text":"RT @VideriQuamEsse: British Jihadi Mother Who Wants to Be First Female Executioner is MI6's Most Wanted http:\/\/t.co\/INZPvpf2tN","label":0}
{"text":"RT @GirlfriendNotes: reasons to be a mermaid:\n\n- no periods\n- no pants\n- perfect hair\n- u get to lure men into their death\n\nalso, free clam&#8230;","label":0}
{"text":"Yo bitch on my dick she come to my crib she get passed around no love","label":1}
{"text":"@Hunglikerobby_ that was so gay. And I was tanning bitch. Juvie made me white","label":1}
{"text":"dem niggas ca have them white hoes.... I love my beautiful black sistas....","label":1}
{"text":"@SoftestMuffin @_tee13 @TorahBlaze at the end of the day, they call yo dumb ass monkey, picka'nanny hoe. But u luv them white devils","label":1}
{"text":"White trash okies don't count as real white people. To count as a white person you have to count a person. Okies aren't people.","label":1}
{"text":"@mayormcginn @usmayors @SenFeinstein White people need those weapons to defend themselves from the subhuman trash your sort unleashes on us.","label":0}
{"text":"Female Jihadis, European &amp; American: GRAVE Dangers! - Joe For America http:\/\/t.co\/9hkpdwq7VR via @mattwalshblog","label":0}
{"text":"RT @UberFacts: Mila Kunis has heterochromia iridum which gives her two different colored eyes. One eye is green, the other is brown.","label":0}
{"text":"Viola, Auntie...you can't call White trash women White trash like this during primetime! #HTGAWM","label":0}
{"text":"RT @LakersTV: VIDEO: @kobebryant on talking trash while facing @NickSwagyPYoung during today&#8217;s scrimmage &#8211; http:\/\/t.co\/3njZFytc1R http:\/\/t.&#8230;","label":0}
{"text":"@PrayForJack new york niggas quick to take off on a bitch in public boy lol!!!!!","label":1}
{"text":"Cheers young lady RT @shik702 @BmoreHumble foreverrrr younnnnng *grabs flask and chugs*","label":0}
{"text":"RT @TheAfricanSiren: Automatically suspicious of white folk who try too hard to show they like us darkies.","label":1}
{"text":"&#8216;Chillin&#8217; With My Homie Or What&#8217;s Left Of Him&#8217;: British Rapper Turned ISIS Jihadi Poses With Severed Head http:\/\/t.co\/L9vMdNOXPg #tcot","label":0}
{"text":"@_TurnDownDre @Jordan__Grimes @kushdaddycorr @TRob_waddUP that's true idk why your even in this convo you dumb nigger attention whore","label":1}
{"text":"@infidelpamelaLC I'm going to blame the black man, since they always blame \"whitey\" I'm an equal opportunity hater.","label":1}
{"text":"RT @KarinaCasallas: LMFAO OH NAH SHE KEEP IT THREE HUNNA\"@catoxx3: @DJZeeti twitpic a selfie if u a ho http:\/\/t.co\/j4RuNFZrtX\"","label":0}
{"text":"@mayormcginn If racial minorities weren't criminally inclined, they wouldn't have so much to worry about. Act your color, race traitor!","label":1}
{"text":"All you muzzy lovers need to do one thing. Tell muzzies in the mideast to leave Israel alone. Don't start no shit won't be no shit. #Israel","label":1}
{"text":"@DeezNutsDoe I'd hate feeling like a faggot too punk ass hoe","label":1}
{"text":"RT @kiddsmy_pyt: You have a new boyfriend every week.. Tf you doin hoe?","label":1}
{"text":"@atspace your 2. And 3. Nigga them hoes suck wayans brothers are not funny at all Jamie foxx should be number 2","label":1}
{"text":"RT @neiltyson: Just to settle it once and for all: Which came first the Chicken or the Egg? The Egg -- laid by a bird that was not a Chicken","label":0}
{"text":"RT @iDntWearCondoms: Stop stalkin your girl social media u bitch ass nigga","label":1}
{"text":"&#9733;@&#9733;@&#9733;@&#9733;@&#9733; GRAND OPENING ! &#9733;@&#9733;@&#9733;@&#9733;@&#9733; TOP CLASS &#9733; Oriental Massage &#9733; PERFECT !&#9733; http:\/\/t.co\/O8JoZOKFEI","label":0}
{"text":"@joeylattime @Mawson38 @ameriC00N thats just me rooting against a team I hate not banwagoning u retard u have a different favorite","label":1}
{"text":"@kitlange stop oppressing me! Have you heard of free speech? Stop shoving your lifestyle down my throat! 1st AMENDMENT! #tcot #teabaggers","label":1}
{"text":"RT @DaTbOySmOkEyy: Shawty said you not gone understand america unless you went to a PWI school, crackers already brainwashed her smh lol","label":1}
{"text":"RT @PacDaGoat: You a hoe if you give your number to another nigga while you got a man","label":1}
{"text":"RT @jerrilyn71: \"@HistoryGoon: hey dicklicker! it says im happily divorced not bitter! homophobic? im not scared of queers..i hate em! fudg&#8230;","label":1}
{"text":"@samzbikowski some negro amigo pulled a gun on Nate and I a few weeks ago. I was STOKED!&#128299;&#128299;&#128299;","label":1}
{"text":"This rain got yall women talking out your ass.. A nigga should spend 80% of his income on a bitch &#128514;&#128514; bruh get these hoes the fuck outta here","label":1}
{"text":"#SlightlyAdjusted RT @CapoToHeaven Alls niggers wanna do is fuck, tweet, and drink pineapple soda all day","label":1}
{"text":"Put the redskins in your starting lineup instead of the Dolphins...it'll be fun they said.","label":0}
{"text":"RT @OhEmmeG: just because you \"not official\" doesnt mean you can act like complete trash and be free from acting like a decent human being","label":0}
{"text":"My hair is trash. I need to put a masque on it.. But that takes so much energy that I don't have.","label":0}
{"text":"Whoever had Mr. Ramlogan for UWI business law tho? Racist mudda cunt","label":1}
{"text":"Dad just yelled out \"in bout to fry some chicken like a nigger\"","label":1}
{"text":"@DeezNutsDoe how about you wash my butthole out with your tongue you little faggot","label":1}
{"text":"RT @jgalt666: Don't let a crisis go to waste.Dems Exploiting Ebola to trash Repubs opposed to Obama&#8217;s choice for Surgeon Gen, http:\/\/t.co\/&#8230;","label":0}
{"text":"@marclamonthill will you mention why being called nigger is wrong(witch i agree with) &amp; bossy is wrong.but being called a pimp is still ok?","label":1}
{"text":"RT @BleacherReport: VIDEO: CFL LB Solomon Elimimian trash talks an opponent during a halftime interview http:\/\/t.co\/EYjinwIWwE http:\/\/t.co\/&#8230;","label":0}
{"text":"Jamaica populated with island hillbillies. Even linguistics are kind of the same, if you sub the accent. Olde English derivatives.","label":0}
{"text":"I've got a birds eye view of all the secrets you keep.","label":0}
{"text":"RT @JOscarJr: @paullemat Happy Birthday! Take a spin in that yellow coupe... #shutemdown http:\/\/t.co\/xGy7gIGOn8","label":0}
{"text":"RT @renegadecut: Video: Renegade Cut: Snowpiercer &#8212; An analysis of Bong Joon-ho&#8217;s sci-fi action film. Topics include... http:\/\/t.co\/YNT9zS0&#8230;","label":0}
{"text":"RT @usmntHistory: On this #USMNT day 2014, the Yanks advanced out of the #GroupOfDeath despite a 0-1 loss to #GER.","label":0}
