{"text":"@united, no. Re-booked with American and United said they'd transfer our bags to them.","label":0}
{"text":"@AmericanAir you're running 5+ hours behind replying to anyone via Twitter. this is beyond unacceptable. I'm running out of time!","label":0}
{"text":"@USAirways 1917. Thanks for the 5 hour layover in LA too👍 Icing on the cake. At least your staff was courteous and helpful.. Not #unreal","label":1}
{"text":"@united Well the bar is set low! You guys are really good at the apology game! What will change? When will u guys learn?","label":0}
{"text":"@SouthwestAir thanks so much just had to make a Cancelled Flightlation! I've sent u the info.","label":1}
{"text":"@USAirways hey guys just want to say I had the best flight ever! Thank you so much. I fell asleep and actually had a wet dream.","label":1}
{"text":"@AmericanAir @nickcunningham1 Except now there is no wait time, the phone system just hangs up on you. So continuing to hold won't help.","label":0}
{"text":"@SouthwestAir me &amp; @sammi_jon3s are best friends because of @Imaginedragons. Any chance we could get tickets to #DestinationDragons ?","label":1}
{"text":"Noooo don't do it, please don't do it 😩RT @JetBlue: Our fleet's on fleek. http:\/\/t.co\/lsxJI0oUvR”","label":0}
{"text":"@SouthwestAir now flying non stop CMH-OAK has me daydreaming about a trip to the bay...especially in this weather. #OhioProbz","label":1}
{"text":"@united I'll make sure he's done that. Thanks for the help. This is a huge race for him and just trying to make sure it goes smoothly. Peace","label":1}
{"text":"@USAirways flight is already over. I think the airline should just have the flight attendants actually emphasize that VAPE is still smoking","label":0}
{"text":"@united private jet would have been cool! Do does not work. I'll try again","label":1}
{"text":"@USAirways captain on flight 1712 from PHX-PHL at 3:55 tonight was hilarious. \"Greetings from the pointy end of the airplane\" haha thanks!","label":1}
{"text":"@JetBlue thanks great recap. I wouldn't have been able to sleep!  I was nervous the bad guy was getting away. 😉","label":1}
{"text":"@JetBlue also. Emergency exit seats. 6'2\" and that's a huge win.","label":1}
{"text":"@JetBlue waiting for a flight to FL for 1\/2 marathon tmrw 4 charity. U bumped us 2a Late Flightr flight &amp; then Cancelled FlightLED IT. How can you fix this?","label":0}
{"text":"@AmericanAir ah if only we could get through. We've tried for over 2 hrs. Can we call @united?","label":0}
{"text":"@AmericanAir my flight to San Angelo via Dallas from Orlando Cancelled Flighted help! On hold and disconnect","label":0}
{"text":"@SouthwestAir stuck in NYC flights Cancelled Flightled 2 days in a row Long wait times on phones. Running out of $ but SWA no help","label":0}
{"text":"Cool! \"@JetBlue: @hgeronemus We are 60% there and anticipate completing installation on all our A320's this year. http:\/\/t.co\/sGckBopATA”","label":1}
{"text":"@VirginAmerica we have a hot female pilot! Sweet! DCA to SFO! :-)","label":1}
{"text":"@united The bright side would be keeping the promise that was made to me. Hope you're having a good night. Thanks.","label":0}
{"text":"@AmericanAir @ejacqui If you updated the screens, then people would know the Late Flightst info, good or bad. And that wouldn't work because...","label":0}
{"text":"@united stay warm - I will be passing through Chicago next week","label":1}
{"text":"@SouthwestAir My husband is responding to him and he insist to remove him from the seat. BTW signs are in both English and Spanish.","label":0}
{"text":"“@JetBlue: Our fleet's on fleek. http:\/\/t.co\/JMnkJ6Bmc2” Jet Blizzue in the hizouse.","label":1}
{"text":"@SouthwestAir please let those with nothing in overhead bins to exit first. Fly a lot and only bring purse. Tired of running for connection","label":0}
{"text":"@AmericanAir My flt AA375 for 02\/23 got cncled and i cant get hold of a CSR so i can get alternate arrangement. Plz help","label":0}
{"text":"@AmericanAir Aww Thanks AA..DFW was on GMA up here this AM..so i understand ..Btw A.A is my Airline when im able to trv..Love you guys.:)","label":1}
{"text":"@USAirways my bag is still lost and I can not get anyone on the phone to assist me and the tracking updates have stopped","label":0}
{"text":"@JetBlue thanks for the upgrade😉!! so far so good. #KeepItUp http:\/\/t.co\/BKmfeY7QOL","label":1}
{"text":"@united is honestly RUINING MY FUCKING LIFE RIGHT NOW. NEVER AGAIN!!!!!!!!!!!!!!!!!!!!!!!!!!!","label":0}
{"text":"@SouthwestAir Once again, I was able to change my flight without any fees... oh and the two free checked bags.  Best airline ever.","label":1}
{"text":"@united question - was given food vouchers but can't use on plane..how   come","label":0}
{"text":"@JetBlue thanks for help. Can't wait to travel with! And get out of the snow.","label":1}
{"text":"@SouthwestAir The Fact That U See Black History Month 12 Months A Year Is Honorable! We WILL BE An Economic Base For Corp. Like U In Future!","label":1}
{"text":"@AmericanAir Hi AA ! I placed an itin on hold to expire on 2\/27.Just logged into my acct..its gone! Seat hasn't been released to inv. Help?","label":0}
{"text":"@VirginAmerica best customer service rep in the world! #irmafromDallas takes the cake!!!","label":1}
{"text":"@JetBlue can't wait! I'll be the one who can't contain herself. 😄","label":1}
{"text":"@USAirways more than an hour holding to change a flight on the phone now.. What's up with that???","label":0}
{"text":"@united is officially my favorite airline. They have created magic for me all day!!! #friendlyskies #careyon","label":1}
{"text":"@JetBlue I would love for you to fly my best friend home to PVD for a weekend. 😊 http:\/\/t.co\/cH0NmjyMgh","label":1}
{"text":"@united Hi, flight 1051. If I try and book a new one way,  flight departure shows up as 3:55pm which seems accurate.","label":1}
{"text":"@VirginAmerica Hi! Just wanted to see if you have any new routes planned this year for Newark. Love flying you guys and hope to do so more!","label":1}
{"text":"@AmericanAir gotta be worse than @delta w\/ on time departures.  I rushed back to terminal C for 8:25 flight but they haven't strtd boarding.","label":0}
{"text":"@united you guys have such big hearts.. keep up the good work","label":1}
{"text":"@JetBlue be flying soon to NYC on your airline, of all airlines I've flown you're still #1 to me 😊😊😊✈️✈️✈️","label":1}
{"text":"@VirginAmerica that doesn't look to fat to me! It looks yummy!","label":1}
{"text":"@AmericanAir no worries even though I was talking about seat assignment :)","label":1}
{"text":"@JetBlue Hi! Just wanted to see if you have any new routes planned this year for Newark. Love flying you guys and hope to do so more!","label":1}
{"text":"@JetBlue we were on b6 619 this morning from Boston to beautiful San Diego. We really were bummed the satellite was broken. :(","label":0}
{"text":"@USAirways any chance u can help our family rebook their flight that was Cancelled Flightled, #4487?","label":0}
{"text":"@JetBlue Happy Anniversary!! It's hard to believe you're 15!! You're so young!","label":1}
{"text":"@AmericanAir for my delay and you know what I get a we don't credit anybody back a supervisor who cut me off when speaking","label":0}
{"text":"@SouthwestAir your social media team just said \"sorry\". Thankfully submitting a complaint got resolution from an amazing rep who called.","label":1}
{"text":"@united Connection at ORD was on the exact same plane again. Checked carry-on was apparently taken off &amp; left in Chicago. Pretty ridiculous.","label":0}
{"text":"@united please give special thanks to Aaron in Tampa office for helping me for literally two hours! He's amazing. Mission accomplished!","label":1}
{"text":"@USAirways I finally spoke to a person. Despite the mind boggling wait time, the rep was very pleasant and very helpful. Kudos to her.","label":1}
{"text":"@JetBlue I would prefer a similar picture but full of E190 tails, but great shot!","label":1}
{"text":"@VirginAmerica of course! I work for @VirginAtlantic and I'm obsessed with the entire Virgin family!!","label":1}
{"text":"@AmericanAir We've 15 official complaints signed by #AmericanAirlines Lima supervisor. Customer Relations pls compensate 4 the 10-hour delay","label":0}
{"text":"@AmericanAir I know you can't control weather but you can control how you treat customers..#shafted","label":0}
{"text":"@USAirways haha no worries you guys are the best!  +1 for spelling my name correctly","label":1}
{"text":"@SouthwestAir Yes! Just a few minutes after my tweet. She was able to reschedule her flight. Thanks!","label":1}
{"text":"@VirginAmerica Thanks for your great customer service today &amp; for helping me get all my travel sorted out!","label":1}
{"text":"@USAirways please fix your reservations phone system.  The weather\/backup could not possibly be bad for 10 days!  #goodgriefpeople","label":0}
{"text":"@USAirways My booked seat ended up being the last row which was labeled \"do no occupy\" had to play musical chairs for 30 mins. Unacceptable","label":0}
{"text":"@AmericanAir what are my chances of making a connection to El Paso (AA504) with DFW from SAT (AA200) delayed 30 minutes?","label":0}
{"text":".@JetBlue handled @0xjared's question like social media pros. Good practice for when our transportation systems are all run by friendly AIs!","label":1}
{"text":"@USAirways  you took the miles out of my account and told me that I could restore by paying $150 or opening a credit card","label":0}
{"text":"Is expiring the @united offer to buy or transfer #United #MileagePlus miles with discount? Many offers during a year http:\/\/t.co\/6tz6imqZlG","label":1}
{"text":"@VirginAmerica I adore you, and am so looking forward to my flight to Austin in two weeks.","label":1}
{"text":"@JetBlue you all are the best #flyfi # ondemand #leatherseats #hipunis #legroom","label":1}
{"text":"@SouthwestAir my wife has now been on hold for 90 minutes....I get weather is bad, but this is insane. #customerservice #customerloyalty","label":0}
{"text":"@united And there is no direct phone number for status match desk? I really regret Flight Booking Problems with @united now.","label":0}
{"text":"@JetBlue even tho the extra 5 lbs are still going on the plane, just as a carry on. Where is the sense? What do you say to fat people?","label":0}
{"text":"@AmericanAir poor customer service is just unacceptable.. Also how bout the surfer on the front of your website. #noloveforsurfers #pretend","label":0}
{"text":"@USAirways On re-accommodation number Lisa (Liza?) in Raleigh was very helpful","label":1}
{"text":"@USAirways @AmericanAir WHERE IS MY BAG ?#SOS ITIS BEING LOST FOR MORE THAN 24 HOURS ! #POORCUSTUMERSERVICE","label":0}
{"text":"@united hi JP, with the help of an awesome TSA representative, I was able to get it all taken care of. Thank you!","label":1}
{"text":"@SouthwestAir you guys held our flight #330!  Thank you!!!  About to take off from MDW now to Oakland.  Thanks","label":1}
{"text":"@virginamerica how's a direct flight FLL-&gt;SFO have unexpected layover in Vegas 4 fuel yet peeps next to me bought for Vegas flight. #sneaky","label":0}
{"text":"@united very missed daughter suppose to dpt ORD @5:59pm - dpted  8:30pm -checked week's average for UA3645 -shameful!  7 day average 7:54pm","label":0}
{"text":"@SouthwestAir I am genuinely surprised you all don't upgrade people when you Cancelled Flight their flights or at least put them in a comparable spot","label":0}
{"text":"@united #1007 Houston-Bogota boarding again, safety first, it seems the mechanics fixed the problem faster, good energy to fly home\/family","label":1}
{"text":"@USAirways @AmericanAir can someone please tell me who I have to talk to #getittogether #findurgrip","label":0}
{"text":"@JetBlue keeps asking me to enter a valid email address. My info is saved and has worked hundreds of times before","label":0}
{"text":"@united Thank you for responding so promptly! I look forward to the 240 kms drive to the office to file a claim.","label":1}
{"text":"@united this will definitely be a trip to remember EWR-STI second of the season, first on seat 35A because it pays to be loyal!","label":1}
{"text":"@united flight 4567 agent now wandered off. Pilots came out looking for her. Went to charge her personal phone which she'd been txting on","label":0}
{"text":"@united If you have had any issues with  United Airlines PLEASE retweet. Paid for a full fight ticket and was given a standby instead.","label":0}
{"text":"@SouthwestAir Just watched crew on flight 380 help elderly lady off plane...#firstclass","label":1}
{"text":"@AmericanAir I've been trying to get through to reservations since yesterday to make a change to a reservation hold, when will it be up?","label":0}
{"text":"@VirginAmerica gave a credit for my Late Flight flight yesterday. Great service !!!! That's a Wow moment! Unexpected gesture!","label":1}
{"text":"@SouthwestAir VERY frustrated. Saw seats avail. online for pref alt. flight, unable to book online, lost those seats during &gt;2 hr phone hold","label":0}
{"text":"@united bad idea to let 200 people back on the terminal with food vouchers but allow only 15 minutes to get anything.  Long lines!! #ua1523","label":0}
{"text":"@united why do you want me to be loyal  if don't let me carry on my bag that easily fits in overhead","label":0}
{"text":"@united Can someone assist me with my DM's? Waiting 1 hour on phone, 2 hours on Twitter.","label":0}
{"text":"@JetBlue The 13th Annual Martha's Vineyard African American Film Festival  August 10-15, 2015   Our attendees deserve a great flight to MV??","label":1}
{"text":"@JetBlue Usually I have such a great experience with you guys? Very, very unhappy with you right now.","label":0}
{"text":"@united Thx, just DM'd. Conf #'s MQXC64 &amp; MPWNC2. Any help appreciated","label":1}
{"text":"@VirginAmerica thank you for the easy itinerary shift for impending weather. Quick, painless &amp; free.","label":1}
{"text":"@SouthwestAir we had early bird, and it was great. Your employees were awesome. It was 3 passengers who killed the buzz.","label":1}
{"text":"@JetBlue I DM'd my confirmation code... Thanks again for your help! Mommy, daddy, and kids appreciate it!","label":1}
{"text":"@JetBlue flight attendant Wendi on Flt 127 on 2\/17, Newark to Orlando.  👍👍","label":1}
{"text":"@SouthwestAir - We left iPad in a seat pocket.  Filed lost item report. Received it exactly 1 week Late Flightr.  Is that a record?  #unbelievable","label":1}
{"text":"@americanair Greatest Newark Gate Agents ever: David Deane, Norma Sedholm and Luz Calderon just made me feel like a king. #AmericanAirlines","label":1}
{"text":"@united seriously what's with the slow #wifi on this flight! If the speed was going to change for the worse then the price shouldn't go up!","label":0}
{"text":"@united so many delays today...What's up with that? Hoping my 12:26pm flight boards soon. #United #premier1K","label":0}
{"text":"@SouthwestAir Thanks 4 the great service, staff, letting me change my flight 5 times for free! PVD to the skies for me always on SWA!","label":1}
{"text":"@JetBlue Why close prechk at 8PM on a Sunday at JFK?  #annoying","label":0}
{"text":"@USAirways yes but lost a whole day.  Frustrating!!  #poor customer service","label":0}
{"text":"@USAirways can't seem to find the pilots for our 6pm flight, never seen anything like it before #drunkpilots http:\/\/t.co\/Zira2z3UDc","label":0}
{"text":"@USAirways after 2 hrs of trying to reach real human, finally did and been on hold for 1:36 hrs for out of synch reservation.","label":0}
{"text":"@JetBlue Thanks for the $100 credit because of the 4hr delay. I can tell customer service means a lot to YOU #Thankful","label":1}
{"text":"@JetBlue great flight and crew! Flight 51 from BOS to MCO","label":1}
{"text":"@united you have failed so uncontrollably today that it's beyond repair. I'm beyond livid with your absolute disregard to operations.","label":0}
{"text":"@SouthwestAir Your onboard wifi is so bad it's taking me 20 minutes to send this tweet.  Working is off the table. #disappointed","label":0}
{"text":"@united obviously the staff at EWR - United or otherwise have not seen your ads about - being FRIENDLY and helpful #ewr worst airport","label":0}
{"text":"@JetBlue to offer service from Daytona Beach to New York - Albany Business Review http:\/\/t.co\/dUhBJ41jHx","label":1}
{"text":"@united thank you! I wish the lady in Little Rock had told me that in the morning when I asked her","label":1}
{"text":"@JetBlue had a great flight to Orlando from Hartford a few weeks ago! Was great to get out on time and arrive early!","label":1}
{"text":".@JetBlue yes. Filed a claim and they issued $30 credit as a courtesy. The whole thing seems exceptionally uncourteous to me.","label":0}
{"text":"@SouthwestAir Thanks for two smooth, safe and fast flights! #Boston #Houston #LUVSWA http:\/\/t.co\/elhxUV0Uj1","label":1}
{"text":"@united met with agent. All taken care of. Thx for reply","label":1}
{"text":"@USAirways Southern Hospitality luggage delivery service from SAV is AWFUL. Great @ delivering empty promises but not luggage #8hrs&amp;waiting","label":0}
{"text":"@AmericanAir pleaseeee find my suitcase. I want deoderant and a clean shirt for work tomorrow :(","label":0}
{"text":"@united  thank you for a great flight in gfc :) Cheers http:\/\/t.co\/nvLnGLnMGN","label":1}
{"text":"@united wasting time at baggage claim thanks to your dfw ground crew who checked my bag in without actually checking for space #frustrated","label":0}
{"text":"@AmericanAir dm me your email address,  I will tell you my ordeal, then you tell me what you think is fair","label":0}
{"text":"“@AmericanAir: @nlrphoto Those are very beautiful photos!” Thx! Would marketing dept be interested in buying?","label":1}
{"text":"@AmericanAir Kid upset, my staff upset (one accused of stealing fruit!!!!!) mistreatment due to airline policy of an Austic child.","label":0}
{"text":"@SouthwestAir Sorry to spam, it would just be so awesome to see @Imaginedragons in Vegas. Your help would be absolutely amazing.","label":1}
{"text":"@JetBlue thanks for your prompt response. I know you put safety first. Unfortunately will hit freezing rain\/sleet on ride home.","label":1}
{"text":"@SouthwestAir @love_dragonss LAUREN OMG IM DEAD IM SO SO HAPPY FOR YOU YES YES","label":1}
{"text":"@united but it's hard to stay upset at someone when they at least TRY to show remorse.","label":0}
{"text":"@united Coach interior on UA 992 looked like it was salvaged from the 80s. Tiny unusable video, no power &amp; lifevests on the floor #UA992 …","label":0}
{"text":"@USAirways great job communicating to the passengers! Flight 1855 doesn't exist anymore? http:\/\/t.co\/hLZaHXkdSn","label":0}
{"text":"@USAirways Yes, ground crew finally showed up so plane could depart very Late Flight.","label":0}
{"text":"@VirginAmerica wish I can afford to fly with you next Friday  going back home.. love everything  about your airline","label":1}
{"text":"@JetBlue thank you for taking care of me with a drink since my in-flight entertainment wasn't working #goodcustomerservice","label":1}
{"text":"@USAirways forgot to call in the copilot so we're stuck on the plane in PHL. Looking fwd to being stranded in CLT. Day 2 of flight fails.","label":0}
{"text":"@SouthwestAir - Great flight from Phoenix to Dallas tonight!Great service and ON TIME! Makes @timieyancey very happy! http:\/\/t.co\/TkVCMhbPim","label":1}
{"text":"@USAirways @AmericanAir Can you bring guinea pigs in small pet carrier onboard your flights?","label":1}
{"text":"@AmericanAir sitting on plane in Columbus, supposed to leave an hour ago. Now the mechanic can't find a tool to service the shock absorber.","label":0}
{"text":"@USAirways sitting on a plane in Philadelphia for over 20 minutes waiting just to get off the plane. Great service!","label":1}
{"text":"@USAirways customer service at its best! Rachel S.  took great care of us at the PHX airport. http:\/\/t.co\/HG7vEqhGHy","label":1}
{"text":"@AmericanAir thank you for quick responses.   #aa usually has fantastic customer service. That's why I was so shocked when it wasn't there","label":1}
{"text":"@USAirways on hold for 1:23. All because they won't let me use a companion voucher online http:\/\/t.co\/DPhQRgkdoA","label":0}
{"text":"@united has the best customer experience via twitter - huge fan!!!","label":1}
{"text":".@AmericanAir No. I watched these bags be abandoned at depart gate. Watched for &gt;40 mins until owner returned, 20+ mins after I reported","label":0}
{"text":"@AmericanAir machines are broken, lines are out the door for self service, cust. Support, and bag check in.","label":0}
{"text":"@SouthwestAir What can we do to bring you back to Jackson, MS?! We miss you terribly around here. These other airlines are horrible!!","label":1}
{"text":"@JetBlue awe you guys are great can't wait to travel with you again soon!!!","label":1}
{"text":"@united flt 912. Capt Herman is amazing! Came out before flight to play \"ask the captain anything.\" Wonderful ambassador to the airline!!","label":1}
{"text":"@united New Apple crâpe, amazing! Live from UA1207. Really nice crew too.  #AmericanAir has biscuits, UA needs them 2 http:\/\/t.co\/gZ9GqDT7Jj","label":1}
{"text":"@SouthwestAir weather bc of system outage. Hopefully everything goes smoothly now. Thank you for follow up","label":1}
{"text":"@SouthwestAir nothing you can do to help us restore some barely-expired #RapidRewards points?","label":0}
{"text":"@USAirways Your policy needs a serious revision for babies.  Fortunately I have choices and choose @Southwest from here on out.","label":0}
{"text":"@AmericanAir But when becomes about get money from the passengers are very strict but don't have ANY feedback as a reward","label":0}
{"text":"@AmericanAir it's not only my bag...it's the complete lack of respect when I called. I was hung up on. And it is my daughters bag","label":0}
{"text":"“@USAirways: We're sincerely sorry, Sean. Reservations is working hard to answer everyone's call and we appreciate your patience.” #false","label":0}
{"text":"@SouthwestAir  I look forward to those direct flights to California to see my family more often. Thank you @MichaelBColeman #byebyeusairline","label":1}
{"text":"@usairways I just learned that although there is travel policy and they waive the change fee-you will still be charged a $25 reservation fee","label":0}
{"text":"@SouthwestAir OH MY GOSH SERIOUSLY?! you just made my day, week, year!!! No one will appreciate this more than me!!!","label":1}
{"text":"@united How can I file a claim when your agents won't let me speak to a supervisor? My claim number is expired because you WON'T find my bag","label":0}
{"text":"@SouthwestAir  THANK YOU for your awesome flights. Sweetheart got screwed on @FlyFrontier, managed to scramble and get a SW plane today. !!!","label":1}
{"text":"@virginamerica you ROCK for making it so I can watch #Oscars on my flight!! #redcarpet #oscars #oscars2015","label":1}
{"text":"@AmericanAir lost my wife's luggage and nobody gives you and answer, all they say is go here or call there.","label":0}
{"text":"@USAirways on the DL, send Ethan some new pants and some \"white revive\" laundry tabs. He's a great guy, good crew, he's just, err, single.","label":1}
{"text":"@USAirways thanks for reaching out to me.  My Gold Div no. 2k424j0. My Flights were changed under Confirmation # DNX58V.","label":1}
{"text":"@SouthwestAir THANK YOU. I left my iPad on a plane, filled out a lost and found form. Yall found it and shipped it back. Thank you #flySW","label":1}
{"text":"@JetBlue thanks to the gent on the phone who fixed my BOS-MCO flight and the fee waiver! A320 now :) #flyfi ! I forget her name :(","label":1}
{"text":"@JetBlue OOH! Good one! Speaking of #MiAmore - Just know that #IAdore https:\/\/t.co\/fWZClBvuG4 Loving #LoveSongFriday","label":1}
{"text":"@USAirways 167 minutes?  \"Im not trained in that\". Cmon. Can't you do better than that?","label":0}
{"text":"@SouthwestAir pleasantly surprised to be boarding my flight on time this morning at @Fly_Nashville. Good job!","label":1}
{"text":"@SouthwestAir  Glad to see you know how to keep the money in your own pockets. 'Thanks' for the voucher in return for lost bag.","label":0}
{"text":"@AmericanAir great job TYR ground crew...now let's get this bird outta here!!!  Tell flight 3200 to wait on me...be there in 45 mikes!","label":1}
{"text":"@AmericanAir thanks for the info Is there a number I can call to speak to a person? It's going to take an hour to type it out","label":1}
{"text":"@united Bag was finally delivered and intact. Thanks for your assistance.","label":1}
{"text":"@AmericanAir excellent!  Love you guys!  If it is first class I'll hug ya'll!  See you shortly!","label":1}
{"text":"@VirginAmerica not worried, it's been a great ride in a new plane with great crew. All airlines should be like this.","label":1}
{"text":"@USAirways awesome! Flight #676 out of philly on Tuesday. Party in row 15 if you're interested.","label":1}
{"text":"@united - thanks for your help...got me what I need, but its an issue with @_austrian . I guess I sit awhile longer.","label":1}
{"text":"@USAirways Thanks to the friendly US Airways staff that helped me get booked on various flights to get home today.  Almost there!","label":1}
{"text":"@AmericanAir but don't you worry... @Delta took good care of me... Your loss, their gain.","label":0}
{"text":"@SouthwestAir cool the plane you said is ours that just left the terminal for a diff city? She a cold betch for \"flying the friendly skies\"","label":0}
{"text":"@united Hi there bag ID is UA6016053916 can you update me and explain why is occurred when I arrived 4 hours before flight!","label":0}
{"text":"@JetBlue Airways Corporation (NASDAQ:JBLU) Reaches on New High Range ... - StreetWise Report http:\/\/t.co\/C7tpdKqULM","label":1}
{"text":"@united Thank you Margo at Houston's Bush Intercontinental for getting me home earlier.","label":1}
{"text":"@americanair @bershawnjackson big UPS to Newark airport staff &amp;&amp; D.Dean. I was also treated lovely while I was in town. ❤❤","label":1}
{"text":"@USAirways The phone line disconnects. How can I be in the queue to be answered when the phone line simply disconnects when I call?","label":0}
{"text":"@AmericanAir I FOUND MY FOOTAGE!! :D I am so so happy.","label":1}
{"text":"@USAirways I've been on hold for over 2 1\/2 hours - there has to be an easier way to Cancelled Flight\/get a refund... 😑😩 http:\/\/t.co\/Cm4roIypc2","label":0}
{"text":"@USAirways How about moving my seats to where I bought them 4 months ago? This happens far too often...","label":0}
{"text":"@USAirways really? 8 hr delay in Virgin Island and not even a food voucher.","label":0}
{"text":"@SouthwestAir Next once we arrived to Atlanta, we waited a full HOUR before our luggage was placed on a carousel. One hour!","label":0}
{"text":"@united does this process ever end? Still waiting for the reply since 2 months #pathetic #customerservice","label":0}
{"text":"@AmericanAir watch out if you are a parent...they break stroller &amp; tell you look at the fine print","label":0}
