{"text":"RT @TalibKweli: Do you want to hear the truth or are you only looking to hear what makes you feel all warm and fuzzy inside? I choose truth&#8230;","label":0}
{"text":"RT @rightwingertoo: Uh oh: California solar plant fries thousands of birds in mid-flight - Hot Air http:\/\/t.co\/8ZQnLR5fH5","label":0}
{"text":"What I look like ho? I look like YES and you look like NO! @NICKIMINAJ","label":1}
{"text":"RT @kingdomofwench: @graceishuman I've also seen a lot of that \"We're Democrats and we're for Charlie Baker!\" ad which makes me want to scr&#8230;","label":0}
{"text":"RT @amnesty2016: Stfu stupid bitch. God damn. Unfuckingfollow me then!!! Shit.","label":1}
{"text":"Wave &#127754; or get Splashed &#128166; on!!! #SplashGang ya bitch you!!","label":1}
{"text":"You're standing on a slippery slope where it's all too easy to... More for Libra http:\/\/t.co\/7THsA7v26i","label":0}
{"text":"@NOTJOHNROSS try being respectful, instead of acting like a fucking retard.","label":1}
{"text":"Just seen a pic comparison of Lou Holtz and he grandma off Beverly hillbillies and I can't stop crying tears of unfathomable hilarity.","label":0}
{"text":"drake needs to make up his mind. Be a rapper or a bitch? haha","label":1}
{"text":"&#8220;@comedianjayski: Happy Hour time best time of da day!!!!!&#8221; Niggas don't know bout them happy hour hoes","label":1}
{"text":"another long night with allergies! need better ned than zertec or however you spell it!","label":0}
{"text":"RT @FriendlyAssh0le: \"i miss my bf\" well, i miss limewire... sooo shut the fuck up, you whiny bitch","label":1}
{"text":"RT @The_April_Fool: Fucking with them hoes! &#8220;@Marc_withdaC: &#8220;@CamBlunt: my nigga waka i hate it had to be him http:\/\/t.co\/E12YlM2yVa&#8221; man t&#8230;","label":1}
{"text":"Take that and shove it up your ass, @KeithOlbermann #Yankees #DerekJeter","label":1}
{"text":"RT @KevinTheGee: &#8220;@ButteryAssRobb: &#8220;@KevinTheGee: okay now I'm going to Krispy Kreme for real&#8221;fat bitch&#8221;@TropicalBlanket this nigga trying &#8230;","label":1}
{"text":"@alexnolan1990 @claddos @takutaneka @regankelly91 ill give you a tip, beware of the ugly birds who hide behind massive lensed sunnies!","label":0}
{"text":"Only Blood Can Satisfy The Hungry Flames Of R&#8217;hollor, Charlie Brown","label":0}
{"text":"@ColeMcDowell2 Waco is ghetto hahaha. Wait til we go pick up nat in Austin tomorrow","label":0}
{"text":"RT @NinerFans: #Seahawks fans are scheduled to meet up at Pier 39 on SAT. @ 5PM to trash talk and heckle San Franciscans! BE PREPARED! WEAR&#8230;","label":0}
{"text":"\"@GEDMelle: 17 missed calls!!!! &#128544;&#128545;\"Das yo P.O bitch twitter finna be screamn #FreeMoneyMelle","label":1}
{"text":"Love having subs cause when my\nMom starts being a fucking bitch I just crank up the system. Simple solutions","label":1}
{"text":"@FaZeDAVlS @SoaR_Wvyy @SoaR_Haze @FaZeOutcsT this is gobbledy gook to me because i dont have the game","label":0}
{"text":"Obama&#8217;s Newly Released Gitmo Jihadi Has Links To Terrorists In Syria http:\/\/t.co\/MywaAFD1yB #tcot #pjnet","label":0}
{"text":"I'm the crazy bitch that will call you 10 times in one hour","label":1}
{"text":"@truckpartstores Intended to get pics but didn't have time.. Must be a mud race\/event here this weekend.. Is like a redneck convoy out there","label":0}
{"text":"@sassycrass She made fun of a suicide attempt. Mellie ain't that bitch to fuck with this season!","label":1}
{"text":"@NoMeek_JustMilz If they trash in yr 3 or 4 he'll waive it lol","label":0}
{"text":"RT @ArcticFox2016: 150 Christians MASSACRED By Jihadi Muslims While They Slept! Including Pastor, His Wife &amp; Kids http:\/\/t.co\/VnR60MjFo6","label":0}
{"text":"RT @DTAVohn269: Best said by @iSpeakMut \"there's a storm brewing bitch\" lmao","label":1}
{"text":"RT @scottvtracy: @AbuYazidMuawiya @amustafaanbari1 Congratulations for reinforcing the stereotype for insecure, uneducated, uncivilized, ba&#8230;","label":0}
{"text":"RT @doddynyc: ya bitches luv throwing bread crumbs on the ground and complain about the pigeons who come flocking towards ya","label":1}
{"text":"I used to get GRs a lot, tho. maybe that's why my soles cracked so much... http:\/\/t.co\/lRCb0vabiG","label":0}
{"text":"The intensity of my Bankhead bounce as I said \"we know these bitches cuz we be traveling\"...","label":1}
{"text":"Big night of &#127936; #hoosiers #iubb #big10 and #pacers #nba #indiana #hoosierstate #paulgeorge #codyzeller http:\/\/t.co\/UFmje1gk","label":0}
{"text":"RT @balvarezzzz: &#8220;@3phonekibagami: @balvarezzzz why you hurt my feelings&#8221; \n\nJk 3phone you pull all the hoes wit the nice weaves","label":1}
{"text":"@kayysavage bitch you looked surprised asf &#128514;&#128557; \"YO MAMA LET YOU DRIVE HER SHIT\" &#9995;&#128514;&#128557;","label":1}
{"text":"@KellenDaniel along with the French blue and Buggs bunny VIIs, and the Oreo IVs. @LaJethroJenkins","label":0}
{"text":"RT @SheSeauxSaditty: Yall act like your pussy did something magical because a nigga suddenly didn't pull out. Naw, he just didn't pull out,&#8230;","label":1}
{"text":"Jordan: so Watcha been up to at college\nMe: fuckin bitches &amp; stuff, ya know\nJordan: alright seriously\n\n&#128533; @Believes116 #IChooseToBeAbstinent","label":1}
{"text":"RT @BiIIMurray: My iPhone has 2 million times the storage of the 1969 Apollo 11 spacecraft computer. They went to the moon. I throw bird ...","label":0}
{"text":"RT @MattieTrump97: Win % since pile of trash @jairusbyrd went to New Orleans:\n\n#Buffalo:1.000\n#NewOrleans:0.0000000000000\n\n#FuckByrd\n#WhoNe&#8230;","label":1}
{"text":"RT @iSpeakComedy: Ever stay home from school and look at the clock and say yeah those bitches in math right now","label":1}
{"text":"RT @blackrepublican: Spike Lee is one of those [wealthy] people he bitches about that's causing gentrification.","label":1}
{"text":"Damn Karlie Redd, now all these hoes done seen your man junk","label":1}
{"text":"RT @KYHoopsBuzz: Latest DraftExpress mock draft has Randle #3, Cauley-Stein #9, Young #14, Poythress #37. Harrison twins &amp; Dakari Johnson a&#8230;","label":0}
{"text":"&#8220;@RylannWilliams: If she buys you a tattoo, wife that girl&#128521;&#128540;&#128527;&#8221; &#128514; this bitch","label":1}
{"text":"RT @SteveStfler: White girls, if your black boyfriend doesn't call you 'shawty', then bitch you ain't that special.","label":1}
{"text":"RT @thecoreyholcomb: If your man is happy in his next relationship your fucked up ways are a blessing bitch","label":1}
{"text":"RT @Prophzilla: @StonerNan @VigxRArts @Bewbzy yea m8, fire crotch igniting your sisters pussy since '06","label":1}
{"text":"@pharary04 stop being a bitch and speaking on my name little girl , thank you.","label":1}
{"text":"@JonnieSantana He's definitely trash. But if Bill Cohwer or Stanford 's head coach want the job I'd hire them. With a new gm of course","label":0}
{"text":"Whipped out some french in front of some babes at the post office. #winning","label":0}
{"text":"@CoronaDior just found u and fuck is my cock hard! Love your dripping pussy","label":1}
{"text":"\"Mine plays DMX and kirk Franklin smh @_justcallmeBRIT: Well my neighbors are ghetto . They get up at like 5am and beat their kids.\"","label":0}
{"text":"RT @erdikken: Where are They Now Fads \nDoc Martens -enjoying anal sex \nGirbaud -Posers, wiggers, fake bangers. Now accountants\nJncos -Domin&#8230;","label":1}
{"text":"@hotzgeor Kept the border open to disease from Central America, lowest workforce part. % since Carter, yep, a real boon to NC.@ThomTillis","label":0}
{"text":"Lol I told Kenzie's bf I was going to stop cussing and he lol'd in my face like bitch u don't even know me","label":1}
{"text":"I'm back bitches 3d back in effect it's on tonite http:\/\/t.co\/dpYLQzG1","label":1}
{"text":"&#8220;@IIiirb: Bouta let Banko kno, I'm goin be a Ronneagle &#128514;&#128527;&#8221; bitch&#128514;&#128529;","label":1}
{"text":"Smashed a werewolf chick and thought she was related to @DominiquePurdy so I felt guilty but then later discovered he didn't know the ho","label":1}
{"text":"Why does MSNBC have a \"news\" show that is 100% opinion &amp; right wing talking points? Joe the nation is with PBO not u teabaggers #morningjoe","label":0}
{"text":"RT @shakiraevanss: Criticize Amanda for saying the n word, sure, but don't make jokes about her sexual assault, don't be trash.","label":0}
{"text":"I've never had a problem w| anybody here, I've been w| the company for a year, and then this snitch fucking bitch is trying to get me fired","label":1}
{"text":"RT @david_marchese: Johnny Cash turned down \"The Gambler.\" Guess you could say he didn't know when to ho . . . never mind.\n http:\/\/t.co\/gMK&#8230;","label":1}
{"text":"Ugly hoes, you can NOT have attitudes! Kill the ratchetness!! You need to be nice, cause your looks sure ain't getting you nowhere!!!!","label":1}
{"text":"@CheckMyLingo_ @Kingpin_Terror ima get this so every time I throw trash away its where it really belongs http:\/\/t.co\/DRGBekvzun","label":0}
{"text":"@pcrossvol there's always one...they never realize they are the worst- the unsolicited unaffiliated trash talker\"","label":0}
{"text":"&#9733; BEST ASIAN MASSAGE ON THE park slope --TOP RATED SPA &#9733; 718-622-0221 - 24 http:\/\/t.co\/Br7el4ZXrw","label":0}
{"text":"RT @Its_NydiaMarie: Fuck your bitch make her call me Papi &#128586;&#128527;","label":1}
{"text":"Video: Charlie Baker campaign team denies contacting Gov. Patrick for meeting http:\/\/t.co\/qHrA6OalRR","label":0}
{"text":"@TyTyTooFlyy I got a bitch named banana pussy bananas swear I gotta say it again pussy bananas my lil cool azz bitch she from da westside","label":1}
{"text":"And girl I've been thinkin of ways thinkin of new ways to beat that pussy down .","label":1}
{"text":"Unfortunately, I love her the most tho RT @KingHorseDick: @viaNAWF thats ur hoe too?","label":1}
{"text":"@keno_ Isn't there a law that all clam chowder must be served im bread bowls? Haha","label":0}
{"text":"RT @OhWowThatsAwk: a girl tweeted \"you might be ghetto if u bring food from outside into the movies\"\n\nno u might be stupid if u pay 4.99 fo&#8230;","label":0}
{"text":"RT @thatgirlran: &#8220;If your 15\/16 ACT like your those ages not like your 20. Its not cute.&#8221; That awk moment when I thought this tweet was abo&#8230;","label":0}
{"text":"My Oriental Gallery Blog: The New Land of Free Enterprise http:\/\/t,co\/pz55t90Z","label":0}
{"text":"Nothing is too spicy. And if it is,\n1) stop being a fucking bitch\n2) eat more of it\n3) cry you fucking pussy","label":1}
{"text":"The Rick Scott\/Charlie Crist ads have been running nearly non-stop in Florida for the past week. And they are getting even worse.","label":0}
{"text":"#ThatFuckMeMoment when you leave your car windows down and it rains in your car and looks like hurricane katrina ran through that bitch","label":1}
{"text":"@SteveStockmanTX @toddstarnes oh I see. Part of a giant govt take over eh. Stockboy you are a joke of a representative. #dumb teabagger","label":1}
{"text":"Nicholas Rushlow, wearing lucky yellow shirt, nails \"theophylline\" - \"bitter crystalline compound extracted from tea leaves\" #spellingbee","label":0}
{"text":"Charlie Rangel: Some Republicans 'Believe That Slavery Isn't Over' | Truth Revolt: http:\/\/t.co\/NpbdPk0Cqz \nBam, Race Card Vote Democrats out","label":0}
{"text":"Early morning beer as a reward for waking up and taking the trash out","label":0}
{"text":"RT @kizzmybutt: You had me at, \"I hate that bitch too\"","label":1}
{"text":"RT @bigbluexpress: Cal has a day off and for giggles heads to Yankee stadium to hang with Derek Jeter. Yep coaching at UK is probably weari&#8230;","label":0}
{"text":"RT @renz360: Got receipt ink on your soles? no problem. http:\/\/t.co\/xYA7aLDUhU","label":0}
{"text":"@_fullawhite haha my nigga coco :,) I can't wait to fuckkk like a hunna hoes this summer haha jk","label":1}
{"text":"RT @TheOnlyReed: Sooner or later ya pussy gon tell\nMe the truth, let's hope it's not while I'm in it, cause Ima kill u","label":1}
{"text":"@Bywatergal @Yankees @EmpireStateBldg That game winning hit in Thursday capped a great career. The guy is a 1st ballot HOF. Or else.","label":0}
{"text":"@BoneSaw00 There's a reason why the Yankees don't want Anderson any longer.","label":0}
{"text":"I'm sorry.. I'm sorry.. I can't fuc wit u no mo hoe.. and I'm sorry &#128514;","label":1}
{"text":"old fellas water froze in that funeral home. he got it unthawed and wants me to help get his pump going again, that place spooks me man..boo","label":0}
{"text":"but shawty you not a bitch you the one I get money wid","label":1}
{"text":"@shanetallant he won't bite! We promise he's a friendly bird :)","label":0}
{"text":"Real talk not being byes or nothin! The whole NFC south glad bag trash this year none of the teams have a chance making it to the playoffs!","label":0}
{"text":"Och hoe wonderbaarlijk dat Jan het alweer met n Marokkaanse BNer aan de stok heeft. Na Fatima, Lamyea, Tofik, nu ook Abdelka te min gevonden","label":0}
{"text":"RT @UberFacts: The strings attached to boxes of animal crackers were originally put there so that the box could be hung from Christmas tree&#8230;","label":0}
{"text":"RT @StillJohnCA: KNOCK KNOCK. Who's there? GEORGE. George who? GEORGE ZIMMERMAN. Oh, George Zimmerman. Welcome to cell block C, bitch!","label":1}
{"text":"A MESSAGE FOR ALL OF HUMANITY ~ Charlie Chaplin @mobengalfan @DISL_Automatic @mikehoho http:\/\/t.co\/itDIRcNt7y","label":0}
{"text":"Shouts out to my down ass bitches who never give a nigga a hard time!","label":1}
{"text":"RT @obscurespinosa: I see people tweeting \"what if the purge comes to my city\" bitch the purge ain't no tour","label":1}
{"text":"@SchulzGrayson @Dswizzle3 you talkinfgalot of shit but you cant back dem words up tho bitch ass nigga u not talking about fighting","label":1}
{"text":"RT @FriendlyAssh0le: bitches with no tits or ass dont even get a hug from me... you're one of the boys now.. you get a handshake.","label":1}
{"text":"RT @TrakkBoiDelf: RT @49ant: when you tryna get bitches on LinkedIn http:\/\/t.co\/UW3R0sNjvk","label":1}
{"text":"You was never with me if you let what another bitch say change your actions towards me &#128080;","label":1}
{"text":"Someone came up &amp; told me that I pulled hoes today. I was pissed just because thats so fucking false that its sad.","label":1}
{"text":"Enjoy 50% off @GreenFestival #DC tickets with our code and check us out at booth #640! Vegan brownies samples &amp; more! http:\/\/t.co\/scDZnDk2Aq","label":0}
{"text":"@Lucci_Dpc What did I prove for you? That you're blissfully ignorant? Group thinker? Political chump and race traitor?","label":0}
{"text":"\"@glowstruck: But a nigga gon be a nigga, be a nigga.\" You sound fuckin retarded","label":1}
{"text":"The beautiful Fairy Pools near Glenbrittle on the Isle of Skye, Scotland http:\/\/t.co\/cyi6xSvn97","label":0}
{"text":"RT @MacMiller: @iCodyMontana @ScHoolBoyQ @xdannyxbrownx yeah they trash. Q... this man capitalized his H tho.... i'm takin all ya fans.","label":0}
{"text":"RT @Gawker: Conan O'Brien mocks the new Call of Duty game while getting killed repeatedly. http:\/\/t.co\/GfCsARhTJT","label":0}
{"text":"I def got a few shades darker cutting my mama grass. There goes my yellow frame lol","label":0}
{"text":"@nick_scott25 sounds about right to many dumb bitches work there welcome to my life","label":1}
{"text":"Can someone treat me to some grub? I'm broke bitch over here.","label":1}
{"text":"remember when the dude who played young ned followed my youtube channel. this was when i actually used my youtube for more than favorites","label":0}
{"text":"Perhaps I'm not a \"diehard\" Yankee fan, but there's no more point in watching this debacle #Yankees #Tigers #MLB So what else is on? LOL","label":0}
{"text":"RT @Henry_3k: When I was little I remember laying horrified in bed as hand puppets held a mock trial convicting me of putting my hand up th&#8230;","label":0}
{"text":"RT @liddoprincess: Call it \"insecure\" if u want but fuck no my man doesn't need to be friendly or have bitches as \"friends\" these hoes ain'&#8230;","label":1}
{"text":"I need a bitch to drop it down for me lol","label":1}
{"text":"RT @GirlTalk26: \"Real men ask for nudes\"\nCorrection. Pussy ass bitches ask for nudes. Real men are out there working for women &amp; actually h&#8230;","label":1}
{"text":"RT @AntiJokeJamal: If you honk your horn .4 seconds after the light turns green, I will shut off my car, lay on the hood, and feed birds fo&#8230;","label":0}
{"text":"Every half-breed cop in America is trying to rape white women.","label":1}
{"text":"I need sum hoes ah sum, cuz I wake up all I have is hella emails &#128557;&#128299; but not a Goodmoring or goodnight text. Shit not even a single text &#9995;&#128529;","label":1}
{"text":"if u don't buy the box of colored goldfish you r a racist tbh","label":0}
{"text":"RT @terri_georgia: Charlie Crist Leads Rick Scott In a Florida Governor's Race Where Every Vote Will Matter http:\/\/t.co\/FWUH5pVnjk","label":0}
{"text":"RT @illest_qveen: im sick of bitches , bitching about other bitches &#128530;","label":1}
{"text":"New test makes your poop neon colored if you have colon cancer &#8594; http:\/\/t.co\/GiGzo0ntpD","label":0}
{"text":"@NYRKelsMads \nDat damn dog eats betta den most colored folk do.","label":0}
{"text":"Man, I got fucked within an inch of my life this evening, I'm so unbothered by that bitch &#128553;&#128514;&#128514; #carryon","label":1}
{"text":"@JRealmo I don't think they believe in their communities ability to function w\/out whitey. They choose to be hustled by big gov't...","label":0}
{"text":"Cause LSU trash RT @BreesInDaCut: Why they doin the College Playoff ranking shit so early?","label":1}
{"text":"@BigRed2OTS she prolly got some bomb pussy too. Lol I hope haha","label":1}
{"text":"Let a nigguh try me , fuck around fuck around fuck around meet his daddy","label":1}
{"text":"@solopo82 y'all got the Taxis right now? And can I get the Oreo 5's right now if possible?","label":0}
{"text":"@rachel_gautreau @babyydrey hey Rachel G my name isint Kenneth ok let's just get that straight &#128070; you best be backing off before I go ghetto","label":0}
{"text":"Only in my hick town can you walk into a national sports bar and get Busch light in a can. SMH","label":0}
{"text":"Man im glad im around to see the redskins go to the playoffs considering it only happens once in a lifetime #RedskinsBlow","label":0}
{"text":"@survivedby @rootsarecertain I figured I was just shocked out hoe old that tweet was lol","label":1}
{"text":"RT @WallStWatkins: A hoe only cares about the now, the future is irrelevant.","label":1}
{"text":"Gary's girl was a tranny. RT @Em_99car: I wonder what would have become of @rickspringfield if he'd written 'Gary's Girl'.","label":0}
{"text":"RT @WhenARapperSaid: When Tyler the Creator said \"Rape a pregnant bitch and tell my friends I had a threesome\" http:\/\/t.co\/ZkvwfK18d0","label":1}
{"text":"@marcostc__ niggas be pressed 4 pussy\nit ain't nuthin\ninstead of worrying who dat bitch fucking \nwhy don't u get chu sum money","label":1}
{"text":"Alexa's phone gave us colors and Julia got yellow I'm dying #racistaf","label":0}
{"text":"&#8220;@BlizzyLC: Police just tried to Rodney King a nigga...&#8221;happen to my nig out here","label":1}
{"text":"#porn,#android,#iphone,#ipad,#sex,#xxx, | #Lingerie | Bitch in lingerie getting her wet cunt pounded http:\/\/t.co\/Jp4r2vPyCb","label":1}
{"text":"RT @BitchieDior: A street nigga don't love nobody if you ain't his day one (bitch, nigga)","label":1}
{"text":"Got to 8 on flappy birds can you say happiest girl on earth","label":0}
{"text":"when ya name gain weight ya ex hoes can't let go","label":1}
{"text":"RT @VideriQuamEsse: British Jihadi Mother Who Wants to Be First Female Executioner is MI6's Most Wanted http:\/\/t.co\/INZPvpf2tN","label":0}
{"text":"RT @GirlfriendNotes: reasons to be a mermaid:\n\n- no periods\n- no pants\n- perfect hair\n- u get to lure men into their death\n\nalso, free clam&#8230;","label":0}
{"text":"\"bitch my vagina is a little more resilient than that\" -@rosestokoe","label":1}
{"text":"Ill fire that nina like its her first day on the job an the bitch over slept","label":1}
{"text":"@zT_Supreme @uncr4fted @yoPapi_chulo it doesnt matter if it was a joke, the fact still remains that hes a faggot for pretending to be a girl","label":1}
{"text":"RT @WORIDSTARHlPHOP: If a Nigga try to slide in my bitch DMs.. http:\/\/t.co\/Mr2FjYUgTn","label":1}
{"text":"\"@TheGamerKingKev: I wonder if the girl that gave head to 24 boys for a drink in magaluf has twitter\" she probly sends nudes for fags","label":1}
{"text":"@mayormcginn @usmayors @SenFeinstein White people need those weapons to defend themselves from the subhuman trash your sort unleashes on us.","label":0}
{"text":"Female Jihadis, European &amp; American: GRAVE Dangers! - Joe For America http:\/\/t.co\/9hkpdwq7VR via @mattwalshblog","label":0}
{"text":"RT @UberFacts: Mila Kunis has heterochromia iridum which gives her two different colored eyes. One eye is green, the other is brown.","label":0}
{"text":"Viola, Auntie...you can't call White trash women White trash like this during primetime! #HTGAWM","label":0}
{"text":"RT @LakersTV: VIDEO: @kobebryant on talking trash while facing @NickSwagyPYoung during today&#8217;s scrimmage &#8211; http:\/\/t.co\/3njZFytc1R http:\/\/t.&#8230;","label":0}
{"text":"RT @s_devante: That moment were u friend zone a bitch at 3am for calling u# do u now way time it is please gtf out my face#rich homie quan &#8230;","label":1}
{"text":"Cheers young lady RT @shik702 @BmoreHumble foreverrrr younnnnng *grabs flask and chugs*","label":0}
{"text":"Not 1 bit of courtesy from any of these bainbridge isl. ferry riders... Fuck em next time I think s gonna \"break down\" paybacks a bitch","label":1}
{"text":"&#8216;Chillin&#8217; With My Homie Or What&#8217;s Left Of Him&#8217;: British Rapper Turned ISIS Jihadi Poses With Severed Head http:\/\/t.co\/L9vMdNOXPg #tcot","label":0}
{"text":"@On_Point_Prg @Fempop @WendyDavisTexas Did you take a picture of your pussy I hope you super sized it because it's huge grand canyon size","label":1}
{"text":"RT @DragonflyJonez: She from the D. She might have some hoes on the stroll. All jokes aside RT @TOO_LIVE_MILZ: Dej loaf dress like Jerome h&#8230;","label":1}
{"text":"RT @KarinaCasallas: LMFAO OH NAH SHE KEEP IT THREE HUNNA\"@catoxx3: @DJZeeti twitpic a selfie if u a ho http:\/\/t.co\/j4RuNFZrtX\"","label":0}
{"text":"I be damn if i go ova dea n get my ass blown&#128163; up i kno wat it look like bitch i play &#128299;Call Of Duty frequently","label":1}
{"text":"RT @versaceezy: she said &#8220;i want a man who can pick me up during sex&#8221; bitch you lucky i picked you up at all gas prices high as hell","label":1}
{"text":"RT @ComedyPosts: When you make a joke and someone you hate laughs and you're thinking: \"No bitch you aren't allowed to laugh\".","label":1}
{"text":"these hoes give it up now, shame i could see they cherry stems in the fucking street.","label":1}
{"text":"RT @Its_Ms_Brenduh: Got kicked out of AA classes bc I laughed at a guy and called him a pussy for blacking out every time he drank.","label":1}
{"text":"RT @neiltyson: Just to settle it once and for all: Which came first the Chicken or the Egg? The Egg -- laid by a bird that was not a Chicken","label":0}
{"text":"No. She's gonna sit tf down &amp; text her \"hoes.\" She's not gonna care about what you're doing.","label":1}
{"text":"&#9733;@&#9733;@&#9733;@&#9733;@&#9733; GRAND OPENING ! &#9733;@&#9733;@&#9733;@&#9733;@&#9733; TOP CLASS &#9733; Oriental Massage &#9733; PERFECT !&#9733; http:\/\/t.co\/O8JoZOKFEI","label":0}
{"text":"RT @__BrighterDays: I don't understand I don't even fuck with these bitches but I'm so relevant to them though &#128564;","label":1}
{"text":"RT @jama_jam: I'm not saying I'm for this but .. Studs will fuck trannys but won't let they bitch strap them down you muhfuckas childish lol","label":1}
{"text":"@sellis1994 @NickEhlers01 @CoryRitter @RToohill @farmersims Agronomist once told me \"beans are a bitch-they do whatever they want\"","label":1}
{"text":"If them niggas pussy we douche em we clean em out","label":1}
{"text":"RT @_aleahmonique: &#128079;\"@WhitDAWGem_: Real bitches who really hungry won't be out here arguing with bitches on twitter straight flexin\"","label":1}
{"text":"@FreeBlazeGawd lmsoooo dawg I ain't got no bitches mane. I low key got a chick but I can't say it on Twitter. You know how these wolves is","label":1}
{"text":"RT @katmurda: I am so nice , but I'm such a bitch .. hard 2 explain","label":1}
{"text":"RT @ChippewaSkylark: i love when celeb nudes leak and all the girls with trash bodies try and critique them","label":1}
{"text":"Put the redskins in your starting lineup instead of the Dolphins...it'll be fun they said.","label":0}
{"text":"RT @OhEmmeG: just because you \"not official\" doesnt mean you can act like complete trash and be free from acting like a decent human being","label":0}
{"text":"My hair is trash. I need to put a masque on it.. But that takes so much energy that I don't have.","label":0}
{"text":"U wont see me sober less i got court Mary the best bitch in life","label":1}
{"text":"Bruh. Sasuke and Sakuras daughter gonna be a bad Uchiha bitch","label":1}
{"text":"RT @49ant: down ass bitch RT @NewsBreaker: Aaron Hernandez's girlfriend lied to grand jury 29 times http:\/\/t.co\/k6x3dUKhtf","label":1}
{"text":"RT @jgalt666: Don't let a crisis go to waste.Dems Exploiting Ebola to trash Repubs opposed to Obama&#8217;s choice for Surgeon Gen, http:\/\/t.co\/&#8230;","label":0}
{"text":"@GrizzboAdams @wyattnuckels bitch I got plans to fuck tonight I said friday nigga","label":1}
{"text":"RT @BleacherReport: VIDEO: CFL LB Solomon Elimimian trash talks an opponent during a halftime interview http:\/\/t.co\/EYjinwIWwE http:\/\/t.co\/&#8230;","label":0}
{"text":"Jamaica populated with island hillbillies. Even linguistics are kind of the same, if you sub the accent. Olde English derivatives.","label":0}
{"text":"I've got a birds eye view of all the secrets you keep.","label":0}
{"text":"RT @JOscarJr: @paullemat Happy Birthday! Take a spin in that yellow coupe... #shutemdown http:\/\/t.co\/xGy7gIGOn8","label":0}
{"text":"RT @renegadecut: Video: Renegade Cut: Snowpiercer &#8212; An analysis of Bong Joon-ho&#8217;s sci-fi action film. Topics include... http:\/\/t.co\/YNT9zS0&#8230;","label":0}
{"text":"RT @usmntHistory: On this #USMNT day 2014, the Yanks advanced out of the #GroupOfDeath despite a 0-1 loss to #GER.","label":0}
